---------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\sdu7\Box Sync\R21_SENSE-MATTERS\DIFVH\POSTED\ANALYSIS\hear_cog.log
  log type:  text
 opened on:  24 Aug 2018, 16:08:00

. use "C:\Users\sdu7\Box Sync\R21_SENSE-MATTERS\DIFVH\POSTED\DATA\DERIVED\vision_cognition_BLSA.dta",clear 

. 
. // explore datasets 
. 
. codebook,com 

Variable       Obs Unique      Mean       Min    Max  Label
---------------------------------------------------------------------------------------------------------------------------------------------------------------
idno          1161    826  4994.184       270   7996  BLSA ID NO
visit         1161     31  7.530577         1     31  Visit Number
home_visit       6      1         .         .      .  Flag to indicate visit was at home (Y)
visacdate     1070    491  20604.25     20100  21142  Visual Acuity Test Date
logmar_pbe    1060     48   .192717      -.16    1.1  LOGMAR VA IN BE USING PVA
pva2040       1060      2  .2528302         0      1  PREST VA worse than 20/40
logmar_pbe10  1060     48   1.92717      -1.6     11  LOGMAR PVA IN BE PER 01.0 CHANGE
logmar_bcbe   1060     45  .0959937      -.16      1  LOGMAR VA IN BCBE
logmar_bc~10  1060     45  .9599368      -1.6     10  LOGMAR VA IN BCBE PER 0.10 CHANGE
va2040        1060      2  .1235849         0      1  VA worse than 20/40 USING BCBE VA
uncor_re      1060      2  .7254717         0      1  UNCORRECTED REFRACTIVE ERROR
contrast      1059      9  1.881586       .75    2.1  LOGCS
cs155         1059      2  .0283286         0      1  CS WORSE THAN 155
contrast10    1059      9  18.81586       7.5     21  LOGCS PER 01.0 CHANGE
sa_min         954      9  75.68134        40    800  MINIMUM SA SEEN
sa80           954      2  .1226415         0      1  SA WORSE THAN (>) 80 SEC OF ARC
vision_visit  1073      3  1.304753         1      3  VISIT W NEW VIS PROTOCOL
typevis       1073      2  1.005592         1      2  
visit_date     984    465   20633.4     19807  21160  visit_date
missed         984     27  2.279472         0     54  TOTAL # POINTES MISSED IN ALL FIELDS
cen            984     13  .5365854         0     31  # POINTS MISSED IN CENTRAL 20 DEGREES OF VIS FIELD
perup          984     14  1.218496         0     13  # POINTS MISSED IN UPPER PERIPHERAL VIS FIELD
perlo          984     11  .5243902         0     10  # POINTS MISSED IN LOWER PERIPHERAL VIS FIELD
vf_impaired    984      2   .070122         0      1  MISSED >1SD OF POP MEAN (>6.5 PTS MISSED)
vf_visit       984      6  2.720528         1      6  
visvfdon      1037      2  .8611379         0      1  _VISVFDON_1436
visvfrnd       140      5  707.2286       555    999  _VISVFRND_963
ina           1161      2  .9242033         0      1  
invf          1161      1         1         1      1  
dov           1161    458  20624.32     19806  21160  Date of visit
age           1074    407  74.34793  22.39999  100.8  Age at time of visit
bmi           1081    783   27.0131     16.87  52.45  ANTH: Body Mass Index
smokehx       1051      4  .3672693         0      3  SMOK: Smoking history
homevisit     1083      1         0         0      0  
cesd          1071     30  5.270775         0     32  CES Depression score
cescut16      1071      2   .054155         0      1  CES Symptoms of depression
cescut20      1071      2  .0233427         0      1  CES Significant symptoms of depression
sbp           1060     86  118.0755        70    192  Composed Systolic blood pressure (mmHg)
dbp           1060     49  66.99245        45     94  Composed Diastolic blood pressure (mmHg)
oact01        1068      3  .3501873         0      8  Currently works
mdhx12        1077      3  .0696379         0      8  Doctor told stroke
mdhx12a         40      5         3         1      8  How long ago most recent stroke
mdhx13        1078      3  .0955473         0      8  Doctor told TIA
mdhx13a         47      5         3         1      8  How long ago most recent TIA
mdhx15        1081      3  .5134135         0      8  Ever told hypertensive
mdhx15a        518      2  .8667954         0      1  Taking medication for hypertension
mdhx15b        102      3  .5882353         0      8  Still have hypertension
mdhx15c        517      2  .8762089         0      1  Lifestyle change for hypertension
mdhx16        1079      3  .1927711         0      8  Doctor told diabetes
mdhx16a        174      3  .4597701         0      8  Taking medication for diabetes
mdhx16b         91      3  1.637363         0      8  Still have diabetes
mdhx16c        169      3  .9704142         0      8  Lifestyle change for diabetes
male          1083      2  .4635272         0      1  
dod              5      2   20875.2     20847  20894  Date of Death
racecd        1080      9  1.409259         0      9  Race
educat        1069      5  3.400374         0      4  Education category (highest attained)
black         1083      2  .2640813         0      1  
smk01         1076      2  .4107807         0      1  Ever smoked 100 cigarettes
smk01a         434      2  .8709677         0      1  Ever smoked regularly
smk01b         378     21  18.63757        11     35  Age began smoking
smk01c         376     22   14.7633         1     60  Average cigarettes per day
smk01d         363      3  .0716253         0      8  Smokes cigarettes now
smk01e          10      8       6.1         1     20  Cigarettes currrently smoked per day
smk01f          10      5       2.2         0     10  Times tried to quit smoking
smk01g         362     50  37.14917        16     82  Age quit smoking
smk02         1074      3  .0810056         0      8  Ever smoked 50 cigars
smk02a          79     22   27.3038        14     51  Age began smoking cigars
smk02b          77     13  5.363636         1     50  Cigars smoked per week
smk02c          74      2  .1216216         0      1  Smokes cigars now
smk02d           9      4  4.111111         1     14  Cigars smoked now per week
smk02e          69     29  40.37681        19     74  Age quit smoking cigars
smk03         1077      3  .1346332         0      8  Ever smoke 3 packages pipe tobacco
smk03a         124     18  23.83065        16     51  Age began pipe smoking
smk03b         122     20  10.09836         1     70  Pipefuls smoked per week
smk03c         113      2  .0265487         0      1  Smokes pipe now
smk03d           3      2        14         0     21  Pipefuls smoked now per week
smk03e         114     31  34.65789        17     68  Age quit pipe smoking
mdhx1         1075      3  .9562791         0      8  Seen doctor since last visit
mdhx2         1077      5  1.618384         1      5  Medical check up frequency
mdhx3         1076      3  .0594796         0      8  Doctor told heart attack
mdhx3a          38      5  3.342105         1      8  How long ago most recent MI
mdhx4         1077      3  .0343547         0      8  Doctor told CHF
mdhx5         1077      2  .0399257         0      1  Doctor told angina
mdhx6         1077      3  .0529248         0      8  Doctor told bronchitis
mdhx7         1077      3  .1142061         0      8  Doctor told asthma
mdhx7a          87      3  .8390805         0      8  Still have asthma
mdhx8         1077      3  .0129991         0      8  Doctor told cirrhosis
mdhx9         1077      3  .0566388         0      8  Doctor told hepatitis
mdhx10        1077      1         0         0      0  Doctor told HIV or AIDS
mdhx11        1078      3  .0500928         0      8  Doctor told kidney disease
mdhx14        1077      3  .2181987         0      8  Doctor told peripheral neuropathy
mdhx17        1082      3  .6580407         0      8  High blood cholesterol
mdhx17b        288      3    2.1875         0      8  Still have high cholesterol
mdhx17c        625      3     .9024         0      8  Lifestyle change for lipid levels
mdhx18        1076      2  .0669145         0      1  Ever had any vascular procedures
mdhx18a1       903      2  .0365449         0      1  Had CABG
mdhx18a2       896      2  .0379464         0      1  Had angioplasty
mdhx18a3       894      2  .0089485         0      1  Had leg bypass surgery
mdhx18a4       894      2  .0134228         0      1  Had leg angioplasty
mdhx18a5       894      2  .0089485         0      1  Had carotid endaterectomy
mdhx18a6       894      2  .0033557         0      1  Had aneurysm repair
mdhx19        1077      3    .36026         0      8  Doctor told cancer
mdh19a1       1084      2  .0046125         0      1  Bladder cancer
mdh19b1        894      5  993.7987        59    999  Age dx with bladder cancer
mdh19a2       1084      2   .001845         0      1  Brain cancer
mdh19b2        892      4  995.8016        11    999  Age dx with brain cancer
mdh19a3       1084      2  .0341328         0      1  Breast cancer
mdh19b3        898     23  960.3563        12    999  Age dx with breast cancer
mdh19a4       1084      2    .00369         0      1  Cervical cancer
mdh19b4        892      4  994.6895        21    999  Age dx with cervical cancer
mdh19a5       1084      2  .0083026         0      1  Colon cancer
mdh19b5        894     10  989.5257        38    999  Age dx with colon cancer
mdh19a6       1084      2  .0046125         0      1  Endometrial cancer
mdh19b6        893      6  993.7301        54    999  Age dx with endometrial cancer
mdh19a7       1084      2    .00369         0      1  Leukemia
mdh19b7        893      4  994.8723        65    999  Age dx with leukemia
mdh19a8       1084      1         0         0      0  Liver cancer
mdh19b8        893      1       999       999    999  Age dx with liver cancer
mdh19a9       1084      2  .0027675         0      1  Lung cancer
mdh19b9        894      4   995.887        57    999  Age dx with lung cancer
mdh19a10      1084      2  .0101476         0      1  Lymphoma
mdh19b10       896      8  987.6429        63    999  Age dx with lymphoma
mdh19a11      1084      2  .0267528         0      1  Melanoma
mdh19b11       900     22  969.9667        35    999  Age dx with melanoma
mdh19a12      1084      2  .0009225         0      1  Ovarian cancer
mdh19b12       893      3  996.8018         1    999  Age dx with ovarian cancer
mdh19a13      1084      1         0         0      0  Pancreatic cancer
mdh19b13       893      1       999       999    999  Age dx with pancreatic cancer
mdh19a14      1084      2  .0728782         0      1  Prostate cancer
mdh19b14       903     26  917.4906        23    999  Age dx with prostate cancer
mdh19a15      1084      2  .1706642         0      1  Skin cancer - basal
mdh19b15       912     52  808.5274         5    999  Age dx with skin cancer - basal
mdh19a16      1084      2  .0701107         0      1  Skin cancer - squamous
mdh19b16       905     35   918.779        40    999  Age dx with skin cancer - squamous
mdh19a17      1084      2   .001845         0      1  Stomach cancer
mdh19b17       892      3  996.8464         1    999  Age dx with stomach cancer
mdh19a18      1084      2  .0064576         0      1  Thyroid cancer
mdh19b18       894      7  990.5526         4    999  Age dx with thyroid cancer
mdh19a19      1084      2  .0295203         0      1  Other cancer
mdh19b19       894     20   966.434        22    999  Age dx with other cancer
mdh19c19       104     46         .         .      .  Other cancer type
mdhx20        1082      3  .6377079         0      8  Doctor told osteoarthritis
mdhx20a1       975      3  .3979487         0      8  Doctor dx OA of knees
mdhx20a2       971      3  .2440783         0      8  Doctor dx OA of hips
mdhx20a3       974      3  .4271047         0      8  Doctor dx OA of hands
mdhx20a4       973      3  .3494347         0      8  Doctor dx OA of back
mdhx20a5       972      3  .2716049         0      8  Doctor dx OA of neck
mdhx20a6       971      3  .1761071         0      8  Doctor dx OA of feet
mdhx20a7       971      3  .2440783         0      8  Doctor dx OA of shoulder
mdhx21        1077      3  .1550604         0      8  Doctor dx spinal stenosis
mdhx22        1079      3  .2771084         0      8  Ever told osteoporosis
mdhx23        1077      3  .1355617         0      8  Doctor told had tissue disease
mdhx24        1077      2   .001857         0      1  Doctor told had Parkinsons
mdhx25        1077      3  .0659239         0      8  Doctor told PAD
mdhx26        1079      3  .2771084         0      8  Doctor told PVD
mdhx27a       1084      3  .6282288         0      8  Had cataract in 1 eye
mdhx27b        998      3   .740481         0      8  Had cataracts in both eyes
mdhx27c       1083      3  .1920591         0      8  Told glaucoma
mdhx27d       1082      3    .24122         0      8  Told retinopathy
mdhx27e       1083      3  .2012927         0      8  Told macular degeneration
mdhx28        1077      3  .0761374         0      8  Doctor told ulcer
mdhx28a         61      3   .147541         0      8  Still have ulcer
mdhx29        1077      3  .1903435         0      8  Doctor told depression
mdhx29a        153      3  .8888889         0      8  Ever treated for depression
cvlifr1tag    1138     12  71.56327        70     99  CVL Missing data tag for IFR1
cvlifr2tag    1138     12  71.58787        70     99  CVL Missing data tag for IFR2
cvlifr3tag    1138     11  71.61336        70     99  CVL Missing data tag for IFR3
cvlifr4tag    1138     11  71.60545        70     99  CVL Missing data tag for IFR4
cvlifr5tag    1138     11  71.60545        70     99  CVL Missing data tag for IFR5
cvlifrbtag    1138     11  71.63445        70     99  CVL Missing data tag for IFRB
cvlsdfrtag    1138     11  71.67135        70     99  CVL Missing data tag for SDFR
cvlsdcrtag    1138     11  71.65905        70     99  CVL Missing data tag for SDCR
cvlldfrtag    1138     11  71.73638        70     99  CVL Missing data tag for LDFR
cvlldcrtag    1138     11  71.74253        70     99  CVL Missing data tag for LDCR
cvlldretag    1138     12  71.67926         7     99  CVL Missing data tag for LDRE
cvltca        1106     65  50.39421         0     80  CVL Total correct A
cvlfrs        1104     17  9.897645         0     16  CVL #Corr A Short-Delay Free Recall
cvlfrl        1104     17   10.3587         0     16  CVL #Corr A Long-Delay Free Recall
flutag        1139     10  71.06234        70     99  Fluency tag
flucat        1129     70  15.48547       3.3     94  CategFluency - mean(fruit, animal, veg)
flulet        1130     77  14.68186         1     94  LettrFluency - mean(F, A, S)
fortag        1140     11  70.90965        70     99  WAIS-R Digits Forward Special data tag
bcktag        1139     11   71.0518        70     99  WAIS-R Digits Backward Special data tag
digfor        1106     14  8.060579         0     14  WAIS-R Digits Forward Traditional score
digbac        1100     15  7.014545         0     14  WAIS-R Digits Backward Traditional score
trailstag     1139     10  71.02107        70     99  NPTAG
trats         1125     80  34.44178        10    300  Trails - A test (seconds)
trbts         1092    181  86.20879        24    300  Trails - B test (seconds)
crdtag        1110     11  71.21802        70     99  Card Rotations: Special data tag
crdrot        1074    185  83.93389        -7    204  Card Rotations: Total score (correct-incorrect)
clktag         994     10  71.12072        70     99  Neuro Clk tag
clk325         983      9  8.504578         0     10  Clock 3:25
clk1110        983      8  8.952187         0     10  Clock 11:10
bvrtag        1110      9  70.70901        70     99  BVR Tag
bvrtot        1099     28  10.42402         0     27  BVR Total errors
oact06a       1072      6  1.467351         0      8  Freq do word puzzles past yr
oact06b       1071      6  .4397759         0      8  Freq do jigsaw puzzles past yr
oact06c       1072      7    3.6875         0      8  Freq read periodicals past yr
oact06d       1072      7  3.166045         0      8  Freq read books past yr
oact06e       1069      6  1.109448         0      8  Freq play board or card games past yr
oact06f       1071      6  3.648926         0      8  Freq use a computer past yr
oact06g       1071      7  .3034547         0      8  Freq play a musical instrument past yr
oact06i       1065      6  1.539906         0      8  Freq write anything past yr
oact06k       1070      6   .811215         0      8  Freq do crafts past yr
oact06l       1071      6  .5957049         0      8  Freq do artwork past yr
ca_sum        1072     31  16.15485         1     72  
ca_ratio      1072     40  1.797834  .1111111      8  
q1             163      5  1.503067         0      4  CFQ need to read again
q2             162      5  1.401235         0      4  CFQ forget why went from one part to other
q3             163      4  .9754601         0      3  CFQ note signpost on the road
q4             163      5   .601227         0      4  CFQ confuse right and left when given directions
q5             162      3  .3950617         0      2  CFQ bump into people
q6             163      5  1.147239         0      4  CFQ forget if turned life off/lock the door
q7             162      5   1.87037         0      4  CFQ listen to peoples names when meeting them
q8             162      4  .8703704         0      3  CFQ say something and realize it might be taking as insulting
q9             162      5  1.345679         0      4  CFQ fail to hear people speaking when doing something else
q10            162      4  .7037037         0      3  CFQ lose your temper and regreted
q11            163      4  .7300613         0      3  CFQ leave important letters unanswered for days
q12            163      4  .6687117         0      3  CFQ forget which way to turn in a road you know
q13            162      5  1.240741         0      4  CFQ fail to see what you want in the supermarket
q14            161      4  .9440994         0      3  CFQ wonder if you have used a word correctly
q15            160      5   1.15625         0      4  CFQ trouble making up your mind
q16            161      4   .689441         0      3  CFQ forget appointments
q17            162      5  1.537037         0      4  CFQ forget where you put something
q18            161      4  .4782609         0      3  CFQ accidentally throwing away the thing you want to keep
q19            162      4  1.197531         0      3  CFQ daydream when ought to be listenig to something
q20            159      5  2.232704         0      4  CFQ forget peoples names
q21            161      4  1.478261         0      3  CFQ start doing one thing and get distracted into doing something else
q22            160      5   1.99375         0      4  CFQ dont remember something that is on the tip of your tongue
q23            162      5  .9320988         0      4  CFQ forget what you went to the store to buy
q24            162      5  .9876543         0      4  CFQ drop things
q25            161      5  .9875776         0      4  CFQ cant think of anything to say
indem         1161      2  .9328165         0      1  
inms          1161      1         1         1      1  
incg          1161      2  .9982773         0      1  
---------------------------------------------------------------------------------------------------------------------------------------------------------------

. 
. /* only keep the first vision viist 
> 
> sort vision_visit
> bys idno: gen tag = _n
> keep if tag ==1 
> */
. 
end of do-file

. do "C:\Users\sdu7\AppData\Local\Temp\STD3e04_000000.tmp"

. foreach var in cognition score test vision vis eye edu sex race diab hyper {
  2. lookfor `var'
  3. }

              storage   display    value
variable name   type    format     label      variable label
---------------------------------------------------------------------------------------------------------------------------------------------------------------
cesd            double  %12.0g                CES Depression score
digfor          double  %12.0g                WAIS-R Digits Forward Traditional score
digbac          double  %12.0g                WAIS-R Digits Backward Traditional score
crdrot          double  %12.0g                Card Rotations: Total score (correct-incorrect)

              storage   display    value
variable name   type    format     label      variable label
---------------------------------------------------------------------------------------------------------------------------------------------------------------
visacdate       long    %d                    Visual Acuity Test Date
trats           double  %11.0g                Trails - A test (seconds)
trbts           double  %11.0g                Trails - B test (seconds)

              storage   display    value
variable name   type    format     label      variable label
---------------------------------------------------------------------------------------------------------------------------------------------------------------
vision_visit    double  %12.0g                VISIT W NEW VIS PROTOCOL

              storage   display    value
variable name   type    format     label      variable label
---------------------------------------------------------------------------------------------------------------------------------------------------------------
visit           double  %12.0g                Visit Number
home_visit      str2    %2s                   Flag to indicate visit was at home (Y)
visacdate       long    %d                    Visual Acuity Test Date
vision_visit    double  %12.0g                VISIT W NEW VIS PROTOCOL
typevis         double  %12.0g                
visit_date      long    %d                    visit_date
cen             double  %12.0g                # POINTS MISSED IN CENTRAL 20 DEGREES OF VIS FIELD
perup           double  %12.0g                # POINTS MISSED IN UPPER PERIPHERAL VIS FIELD
perlo           double  %12.0g                # POINTS MISSED IN LOWER PERIPHERAL VIS FIELD
vf_visit        double  %12.0g                
visvfdon        double  %8.0g                 _VISVFDON_1436
visvfrnd        double  %8.0g                 _VISVFRND_963
dov             long    %d                    Date of visit
age             double  %12.0g                Age at time of visit
homevisit       double  %12.0g                
mdhx1           double  %8.0g                 Seen doctor since last visit

              storage   display    value
variable name   type    format     label      variable label
---------------------------------------------------------------------------------------------------------------------------------------------------------------
mdhx27a         double  %8.0g                 Had cataract in 1 eye
mdhx27b         double  %8.0g                 Had cataracts in both eyes

              storage   display    value
variable name   type    format     label      variable label
---------------------------------------------------------------------------------------------------------------------------------------------------------------
educat          double  %12.0g                Education category (highest attained)
mdhx18          double  %8.0g                 Ever had any vascular procedures

              storage   display    value
variable name   type    format     label      variable label
---------------------------------------------------------------------------------------------------------------------------------------------------------------
racecd          double  %12.0g                Race

              storage   display    value
variable name   type    format     label      variable label
---------------------------------------------------------------------------------------------------------------------------------------------------------------
mdhx16          double  %8.0g                 Doctor told diabetes
mdhx16a         double  %8.0g                 Taking medication for diabetes
mdhx16b         double  %8.0g                 Still have diabetes
mdhx16c         double  %8.0g                 Lifestyle change for diabetes

              storage   display    value
variable name   type    format     label      variable label
---------------------------------------------------------------------------------------------------------------------------------------------------------------
mdhx15          double  %8.0g                 Ever told hypertensive
mdhx15a         double  %8.0g                 Taking medication for hypertension
mdhx15b         double  %8.0g                 Still have hypertension
mdhx15c         double  %8.0g                 Lifestyle change for hypertension

. 
end of do-file

. do "C:\Users\sdu7\AppData\Local\Temp\STD3e04_000000.tmp"

. foreach var in cognition score test vision va eye edu sex race diab hyper {
  2. lookfor `var'
  3. }

              storage   display    value
variable name   type    format     label      variable label
---------------------------------------------------------------------------------------------------------------------------------------------------------------
cesd            double  %12.0g                CES Depression score
digfor          double  %12.0g                WAIS-R Digits Forward Traditional score
digbac          double  %12.0g                WAIS-R Digits Backward Traditional score
crdrot          double  %12.0g                Card Rotations: Total score (correct-incorrect)

              storage   display    value
variable name   type    format     label      variable label
---------------------------------------------------------------------------------------------------------------------------------------------------------------
visacdate       long    %d                    Visual Acuity Test Date
trats           double  %11.0g                Trails - A test (seconds)
trbts           double  %11.0g                Trails - B test (seconds)

              storage   display    value
variable name   type    format     label      variable label
---------------------------------------------------------------------------------------------------------------------------------------------------------------
vision_visit    double  %12.0g                VISIT W NEW VIS PROTOCOL

              storage   display    value
variable name   type    format     label      variable label
---------------------------------------------------------------------------------------------------------------------------------------------------------------
logmar_pbe      double  %12.0g                LOGMAR VA IN BE USING PVA
pva2040         double  %12.0g                PREST VA worse than 20/40
logmar_pbe10    double  %12.0g                LOGMAR PVA IN BE PER 01.0 CHANGE
logmar_bcbe     double  %12.0g                LOGMAR VA IN BCBE
logmar_bcbe10   double  %12.0g                LOGMAR VA IN BCBE PER 0.10 CHANGE
va2040          double  %12.0g                VA worse than 20/40 USING BCBE VA
mdhx18          double  %8.0g                 Ever had any vascular procedures
mdh19a12        double  %8.0g                 Ovarian cancer
mdh19b12        double  %8.0g                 Age dx with ovarian cancer

              storage   display    value
variable name   type    format     label      variable label
---------------------------------------------------------------------------------------------------------------------------------------------------------------
mdhx27a         double  %8.0g                 Had cataract in 1 eye
mdhx27b         double  %8.0g                 Had cataracts in both eyes

              storage   display    value
variable name   type    format     label      variable label
---------------------------------------------------------------------------------------------------------------------------------------------------------------
educat          double  %12.0g                Education category (highest attained)
mdhx18          double  %8.0g                 Ever had any vascular procedures

              storage   display    value
variable name   type    format     label      variable label
---------------------------------------------------------------------------------------------------------------------------------------------------------------
racecd          double  %12.0g                Race

              storage   display    value
variable name   type    format     label      variable label
---------------------------------------------------------------------------------------------------------------------------------------------------------------
mdhx16          double  %8.0g                 Doctor told diabetes
mdhx16a         double  %8.0g                 Taking medication for diabetes
mdhx16b         double  %8.0g                 Still have diabetes
mdhx16c         double  %8.0g                 Lifestyle change for diabetes

              storage   display    value
variable name   type    format     label      variable label
---------------------------------------------------------------------------------------------------------------------------------------------------------------
mdhx15          double  %8.0g                 Ever told hypertensive
mdhx15a         double  %8.0g                 Taking medication for hypertension
mdhx15b         double  %8.0g                 Still have hypertension
mdhx15c         double  %8.0g                 Lifestyle change for hypertension

. 
. 
. 
. 
end of do-file

. do "C:\Users\sdu7\AppData\Local\Temp\STD3e04_000000.tmp"

. use  "C:\Users\sdu7\Box Sync\R21_SENSE-MATTERS\DIFVH\POSTED\DATA\DERIVED\vision_blsa.dta",clear 

. 
end of do-file

. do "C:\Users\sdu7\AppData\Local\Temp\STD3e04_000000.tmp"

. codebook,com 

Variable      Obs Unique      Mean       Min       Max  Label
---------------------------------------------------------------------------------------------------------------------------------------------------------------
idno          800    800  4973.682       270      7996  BLSA ID
visit         800     29   7.12125         1        31  Visit Number
dov           800    428  20526.94     20094     21110  Date of visit
home_visit      0      0         .         .         .  Flag to indicate visit was at home (Y)
age           791    379  71.55674  22.39999  98.79999  Age at time of visit
bmi           799    640  27.34731     17.13     52.45  ANTH: Body Mass Index
smokehx       793      4  .3783102         0         3  SMOK: Smoking history
homevisit     800      1         0         0         0  
cesd          792     28  5.138889         0        32  CES Depression score
cescut16      792      2  .0530303         0         1  CES Symptoms of depression
cescut20      792      2  .0265152         0         1  CES Significant symptoms of depression
sbp           783     83  117.4176        70       192  Composed Systolic blood pressure (mmHg)
dbp           783     47  67.64496        45        94  Composed Diastolic blood pressure (mmHg)
oact01        788      3  .4149746         0         8  Currently works
mdhx12        785      3  .0611465         0         8  Doctor told stroke
mdhx12a        27      5  2.851852         1         8  How long ago most recent stroke
mdhx13        785      3  .0547771         0         8  Doctor told TIA
mdhx13a        27      4  2.888889         1         8  How long ago most recent TIA
mdhx15        786      3  .4974555         0         8  Ever told hypertensive
mdhx15a       366      2  .8606557         0         1  Taking medication for hypertension
mdhx15b        80      3      .575         0         8  Still have hypertension
mdhx15c       366      2  .8442623         0         1  Lifestyle change for hypertension
mdhx16        785      3  .2140127         0         8  Doctor told diabetes
mdhx16a       135      2  .4444444         0         1  Taking medication for diabetes
mdhx16b        68      3  1.661765         0         8  Still have diabetes
mdhx16c       130      2  .8923077         0         1  Lifestyle change for diabetes
male          800      2     .4475         0         1  
dod             2      2   20870.5     20847     20894  Date of Death
racecd        797      9  1.432873         0         9  Race
educat        786      5  3.384224         0         4  Education category (highest attained)
black         800      2      .285         0         1  
visacdate     795    426  20526.32     20100     21110  Visual Acuity Test Date
logmar_pbe    788     44  .1769036      -.16       1.1  LOGMAR VA IN BE USING PVA
pva2040       788      2  .2258883         0         1  PREST VA worse than 20/40
logmar_pbe10  788     44  1.769036      -1.6        11  LOGMAR PVA IN BE PER 01.0 CHANGE
logmar_bcbe   788     41  .0817701      -.16         1  LOGMAR VA IN BCBE
logmar_bc~10  788     41  .8177012      -1.6        10  LOGMAR VA IN BCBE PER 0.10 CHANGE
va2040        788      2  .1027919         0         1  VA worse than 20/40 USING BCBE VA
uncor_re      788      2  .7271574         0         1  UNCORRECTED REFRACTIVE ERROR
contrast      787      8  1.891105      1.05       2.1  LOGCS
cs155         787      2  .0304956         0         1  CS WORSE THAN 155
contrast10    787      8  18.91105      10.5        21  LOGCS PER 01.0 CHANGE
sa_min        696      9  72.02586        40       800  MINIMUM SA SEEN
sa80          696      2  .1063218         0         1  SA WORSE THAN (>) 80 SEC OF ARC
vision_visit  798      3  1.028822         1         3  VISIT W NEW VIS PROTOCOL
typevis       798      1         1         1         1  
visit_date    696    374  20530.96     19807     21111  visit_date
missed        696     24  1.880747         0        54  TOTAL # POINTES MISSED IN ALL FIELDS
cen           696     10   .441092         0        31  # POINTS MISSED IN CENTRAL 20 DEGREES OF VIS FIELD
perup         696     14  .9899425         0        13  # POINTS MISSED IN UPPER PERIPHERAL VIS FIELD
perlo         696     10  .4497126         0        10  # POINTS MISSED IN LOWER PERIPHERAL VIS FIELD
vf_impaired   696      2  .0502874         0         1  MISSED >1SD OF POP MEAN (>6.5 PTS MISSED)
vf_visit      696      5  2.408046         1         5  
visvfdon      756      2  .8862434         0         1  _VISVFDON_1436
visvfrnd       82      5  703.9024       555       999  _VISVFRND_963
ina           800      2     .9975         0         1  
invf          800      1         1         1         1  
vadone        800      2      .985         0         1  
vfdone        800      2       .87         0         1  
pr            800      3      1.16         1         3  
selected_v~t  800     29   7.12125         1        31  
invs          800      1         1         1         1  
svisit        800     29   7.12125         1        31  
---------------------------------------------------------------------------------------------------------------------------------------------------------------

. duplicates report idno 

Duplicates in terms of idno

--------------------------------------
   copies | observations       surplus
----------+---------------------------
        1 |          800             0
--------------------------------------

. 
. 
end of do-file

. tab va2040

   VA worse |
 than 20/40 |
 USING BCBE |
         VA |      Freq.     Percent        Cum.
------------+-----------------------------------
          0 |        707       89.72       89.72
          1 |         81       10.28      100.00
------------+-----------------------------------
      Total |        788      100.00

. do "C:\Users\sdu7\AppData\Local\Temp\STD3e04_000000.tmp"

. cd "C:\Users\sdu7\Box Sync\R21_SENSE-MATTERS\DIFVH\POSTED\ANALYSIS"
C:\Users\sdu7\Box Sync\R21_SENSE-MATTERS\DIFVH\POSTED\ANALYSIS

. 
. use  "C:\Users\sdu7\Box Sync\R21_SENSE-MATTERS\DIFVH\POSTED\DATA\DERIVED\cognition_all.dta",clear 

. 
. 
. // merge dataset
. 
. merge 1:1 idno visit using "C:\Users\sdu7\Box Sync\R21_SENSE-MATTERS\DIFVH\POSTED\DATA\DERIVED\vision_demo_all.dta"

    Result                           # of obs.
    -----------------------------------------
    not matched                            83
        from master                        81  (_merge==1)
        from using                          2  (_merge==2)

    matched                             1,081  (_merge==3)
    -----------------------------------------

. codebook,com 

Variable       Obs Unique      Mean       Min       Max  Label
---------------------------------------------------------------------------------------------------------------------------------------------------------------
idno          1164    827  4991.773       270      7996  BLSA ID NO
visit         1164     31  7.537801         1        31  Visit Number
dov           1164    457  20602.42     10974     21158  Date of Visit
cvlifr1tag    1138     12  71.56327        70        99  CVL Missing data tag for IFR1
cvlifr2tag    1138     12  71.58787        70        99  CVL Missing data tag for IFR2
cvlifr3tag    1138     11  71.61336        70        99  CVL Missing data tag for IFR3
cvlifr4tag    1138     11  71.60545        70        99  CVL Missing data tag for IFR4
cvlifr5tag    1138     11  71.60545        70        99  CVL Missing data tag for IFR5
cvlifrbtag    1138     11  71.63445        70        99  CVL Missing data tag for IFRB
cvlsdfrtag    1138     11  71.67135        70        99  CVL Missing data tag for SDFR
cvlsdcrtag    1138     11  71.65905        70        99  CVL Missing data tag for SDCR
cvlldfrtag    1138     11  71.73638        70        99  CVL Missing data tag for LDFR
cvlldcrtag    1138     11  71.74253        70        99  CVL Missing data tag for LDCR
cvlldretag    1138     12  71.67926         7        99  CVL Missing data tag for LDRE
cvltca        1107     65  50.38121         0        80  CVL Total correct A
cvlfrs        1105     17  9.894118         0        16  CVL #Corr A Short-Delay Free Recall
cvlfrl        1105     17  10.35475         0        16  CVL #Corr A Long-Delay Free Recall
flutag        1139     10  71.06234        70        99  Fluency tag
flucat        1130     71  15.48442       3.3        94  CategFluency - mean(fruit, animal, veg)
flulet        1131     77  14.68391         1        94  LettrFluency - mean(F, A, S)
fortag        1141     11  70.90885        70        99  WAIS-R Digits Forward Special data tag
bcktag        1140     11  71.05088        70        99  WAIS-R Digits Backward Special data tag
digfor        1107     14  8.062331         0        14  WAIS-R Digits Forward Traditional score
digbac        1101     15  7.015441         0        14  WAIS-R Digits Backward Traditional score
trailstag     1139     10  71.02107        70        99  NPTAG
trats         1126     80  34.43606        10       300  Trails - A test (seconds)
trbts         1093    181  86.17932        24       300  Trails - B test (seconds)
crdtag        1111     11  71.21692        70        99  Card Rotations: Special data tag
crdrot        1075    185  83.91535        -7       204  Card Rotations: Total score (correct-incorrect)
clktag         994     10  71.12072        70        99  Neuro Clk tag
clk325         984      9  8.505081         0        10  Clock 3:25
clk1110        984      8  8.953252         0        10  Clock 11:10
bvrtag        1110      9  70.70901        70        99  BVR Tag
bvrtot        1100     28  10.41545         0        27  BVR Total errors
oact06a       1072      6  1.467351         0         8  Freq do word puzzles past yr
oact06b       1071      6  .4397759         0         8  Freq do jigsaw puzzles past yr
oact06c       1072      7    3.6875         0         8  Freq read periodicals past yr
oact06d       1072      7  3.166045         0         8  Freq read books past yr
oact06e       1069      6  1.109448         0         8  Freq play board or card games past yr
oact06f       1071      6  3.648926         0         8  Freq use a computer past yr
oact06g       1071      7  .3034547         0         8  Freq play a musical instrument past yr
oact06i       1065      6  1.539906         0         8  Freq write anything past yr
oact06k       1070      6   .811215         0         8  Freq do crafts past yr
oact06l       1071      6  .5957049         0         8  Freq do artwork past yr
ca_sum        1072     31  16.15485         1        72  
ca_ratio      1072     40  1.797834  .1111111         8  
q1             163      5  1.503067         0         4  CFQ need to read again
q2             162      5  1.401235         0         4  CFQ forget why went from one part to other
q3             163      4  .9754601         0         3  CFQ note signpost on the road
q4             163      5   .601227         0         4  CFQ confuse right and left when given directions
q5             162      3  .3950617         0         2  CFQ bump into people
q6             163      5  1.147239         0         4  CFQ forget if turned life off/lock the door
q7             162      5   1.87037         0         4  CFQ listen to peoples names when meeting them
q8             162      4  .8703704         0         3  CFQ say something and realize it might be taking as insulting
q9             162      5  1.345679         0         4  CFQ fail to hear people speaking when doing something else
q10            162      4  .7037037         0         3  CFQ lose your temper and regreted
q11            163      4  .7300613         0         3  CFQ leave important letters unanswered for days
q12            163      4  .6687117         0         3  CFQ forget which way to turn in a road you know
q13            162      5  1.240741         0         4  CFQ fail to see what you want in the supermarket
q14            161      4  .9440994         0         3  CFQ wonder if you have used a word correctly
q15            160      5   1.15625         0         4  CFQ trouble making up your mind
q16            161      4   .689441         0         3  CFQ forget appointments
q17            162      5  1.537037         0         4  CFQ forget where you put something
q18            161      4  .4782609         0         3  CFQ accidentally throwing away the thing you want to keep
q19            162      4  1.197531         0         3  CFQ daydream when ought to be listenig to something
q20            159      5  2.232704         0         4  CFQ forget peoples names
q21            161      4  1.478261         0         3  CFQ start doing one thing and get distracted into doing something else
q22            160      5   1.99375         0         4  CFQ dont remember something that is on the tip of your tongue
q23            162      5  .9320988         0         4  CFQ forget what you went to the store to buy
q24            162      5  .9876543         0         4  CFQ drop things
q25            161      5  .9875776         0         4  CFQ cant think of anything to say
dxatvi        1081      4  .0263645       -.5         1  
smk01         1074      2  .4115456         0         1  Ever smoked 100 cigarettes
smk01a         434      2  .8709677         0         1  Ever smoked regularly
smk01b         378     21  18.63757        11        35  Age began smoking
smk01c         376     22   14.7633         1        60  Average cigarettes per day
smk01d         363      3  .0716253         0         8  Smokes cigarettes now
smk01e          10      8       6.1         1        20  Cigarettes currrently smoked per day
smk01f          10      5       2.2         0        10  Times tried to quit smoking
smk01g         362     50  37.14917        16        82  Age quit smoking
smk02         1072      3  .0802239         0         8  Ever smoked 50 cigars
smk02a          78     22  27.26923        14        51  Age began smoking cigars
smk02b          76     13  5.342105         1        50  Cigars smoked per week
smk02c          73      2  .1232877         0         1  Smokes cigars now
smk02d           9      4  4.111111         1        14  Cigars smoked now per week
smk02e          68     28        40        19        74  Age quit smoking cigars
smk03         1075      3  .1339535         0         8  Ever smoke 3 packages pipe tobacco
smk03a         123     18  23.84553        16        51  Age began pipe smoking
smk03b         121     20  10.17355         1        70  Pipefuls smoked per week
smk03c         112      2  .0267857         0         1  Smokes pipe now
smk03d           3      2        14         0        21  Pipefuls smoked now per week
smk03e         113     31  34.74336        17        68  Age quit pipe smoking
mdhx1         1073      3  .9561976         0         8  Seen doctor since last visit
mdhx2         1075      5  1.619535         1         5  Medical check up frequency
mdhx3         1074      3  .0595903         0         8  Doctor told heart attack
mdhx3a          38      5  3.342105         1         8  How long ago most recent MI
mdhx4         1075      3  .0344186         0         8  Doctor told CHF
mdhx5         1075      2       .04         0         1  Doctor told angina
mdhx6         1075      3  .0530233         0         8  Doctor told bronchitis
mdhx7         1075      3  .1144186         0         8  Doctor told asthma
mdhx7a          87      3  .8390805         0         8  Still have asthma
mdhx8         1075      3  .0130233         0         8  Doctor told cirrhosis
mdhx9         1075      3  .0567442         0         8  Doctor told hepatitis
mdhx10        1075      1         0         0         0  Doctor told HIV or AIDS
mdhx11        1076      3  .0501859         0         8  Doctor told kidney disease
mdhx12        1077      3  .0696379         0         8  Doctor told stroke
mdhx12a         40      5         3         1         8  How long ago most recent stroke
mdhx13        1078      3  .0955473         0         8  Doctor told TIA
mdhx13a         47      5         3         1         8  How long ago most recent TIA
mdhx14        1075      3  .2186047         0         8  Doctor told peripheral neuropathy
mdhx15        1081      3  .5134135         0         8  Ever told hypertensive
mdhx15a        518      2  .8667954         0         1  Taking medication for hypertension
mdhx15b        102      3  .5882353         0         8  Still have hypertension
mdhx15c        517      2  .8762089         0         1  Lifestyle change for hypertension
mdhx16        1079      3  .1927711         0         8  Doctor told diabetes
mdhx16a        174      3  .4597701         0         8  Taking medication for diabetes
mdhx16b         91      3  1.637363         0         8  Still have diabetes
mdhx16c        169      3  .9704142         0         8  Lifestyle change for diabetes
mdhx17        1080      3  .6574074         0         8  High blood cholesterol
mdhx17b        287      3  2.191638         0         8  Still have high cholesterol
mdhx17c        623      3  .9020867         0         8  Lifestyle change for lipid levels
mdhx18        1074      2  .0670391         0         1  Ever had any vascular procedures
mdhx18a1       901      2   .036626         0         1  Had CABG
mdhx18a2       894      2  .0380313         0         1  Had angioplasty
mdhx18a3       892      2  .0089686         0         1  Had leg bypass surgery
mdhx18a4       892      2  .0134529         0         1  Had leg angioplasty
mdhx18a5       892      2  .0089686         0         1  Had carotid endaterectomy
mdhx18a6       892      2  .0033632         0         1  Had aneurysm repair
mdhx19        1075      3  .3590698         0         8  Doctor told cancer
mdh19a1       1082      2  .0046211         0         1  Bladder cancer
mdh19b1        892      5   993.787        59       999  Age dx with bladder cancer
mdh19a2       1082      2  .0018484         0         1  Brain cancer
mdh19b2        890      4  995.7944        11       999  Age dx with brain cancer
mdh19a3       1082      2  .0341959         0         1  Breast cancer
mdh19b3        896     23  960.2701        12       999  Age dx with breast cancer
mdh19a4       1082      2  .0036969         0         1  Cervical cancer
mdh19b4        890      4  994.6798        21       999  Age dx with cervical cancer
mdh19a5       1082      2  .0083179         0         1  Colon cancer
mdh19b5        892     10  989.5045        38       999  Age dx with colon cancer
mdh19a6       1082      2  .0046211         0         1  Endometrial cancer
mdh19b6        891      6  993.7183        54       999  Age dx with endometrial cancer
mdh19a7       1082      2  .0027726         0         1  Leukemia
mdh19b7        891      3  995.9113        79       999  Age dx with leukemia
mdh19a8       1082      1         0         0         0  Liver cancer
mdh19b8        891      1       999       999       999  Age dx with liver cancer
mdh19a9       1082      2  .0027726         0         1  Lung cancer
mdh19b9        892      4    995.88        57       999  Age dx with lung cancer
mdh19a10      1082      2  .0101664         0         1  Lymphoma
mdh19b10       894      8  987.6174        63       999  Age dx with lymphoma
mdh19a11      1082      2  .0268022         0         1  Melanoma
mdh19b11       898     22   969.902        35       999  Age dx with melanoma
mdh19a12      1082      2  .0009242         0         1  Ovarian cancer
mdh19b12       891      3  996.7969         1       999  Age dx with ovarian cancer
mdh19a13      1082      1         0         0         0  Pancreatic cancer
mdh19b13       891      1       999       999       999  Age dx with pancreatic cancer
mdh19a14      1082      2  .0720887         0         1  Prostate cancer
mdh19b14       901     26  918.3407        23       999  Age dx with prostate cancer
mdh19a15      1082      2  .1700555         0         1  Skin cancer - basal
mdh19b15       910     52  809.1363         5       999  Age dx with skin cancer - basal
mdh19a16      1082      2  .0693161         0         1  Skin cancer - squamous
mdh19b16       903     35  919.6368        40       999  Age dx with skin cancer - squamous
mdh19a17      1082      2  .0018484         0         1  Stomach cancer
mdh19b17       890      3  996.8416         1       999  Age dx with stomach cancer
mdh19a18      1082      2  .0064695         0         1  Thyroid cancer
mdh19b18       892      7  990.5336         4       999  Age dx with thyroid cancer
mdh19a19      1082      2  .0295749         0         1  Other cancer
mdh19b19       892     20   966.361        22       999  Age dx with other cancer
mdh19c19       103     46         .         .         .  Other cancer type
mdhx20        1080      3   .637037         0         8  Doctor told osteoarthritis
mdhx20a1       973      3   .397739         0         8  Doctor dx OA of knees
mdhx20a2       969      3  .2435501         0         8  Doctor dx OA of hips
mdhx20a3       972      3  .4279835         0         8  Doctor dx OA of hands
mdhx20a4       971      3  .3501545         0         8  Doctor dx OA of back
mdhx20a5       970      3  .2721649         0         8  Doctor dx OA of neck
mdhx20a6       969      3  .1754386         0         8  Doctor dx OA of feet
mdhx20a7       969      3   .244582         0         8  Doctor dx OA of shoulder
mdhx21        1075      3  .1553488         0         8  Doctor dx spinal stenosis
mdhx22        1077      3  .2766945         0         8  Ever told osteoporosis
mdhx23        1075      3   .135814         0         8  Doctor told had tissue disease
mdhx24        1075      2  .0018605         0         1  Doctor told had Parkinsons
mdhx25        1075      3  .0660465         0         8  Doctor told PAD
mdhx26        1077      3   .277623         0         8  Doctor told PVD
mdhx27a       1082      3  .6284658         0         8  Had cataract in 1 eye
mdhx27b        996      3  .7339357         0         8  Had cataracts in both eyes
mdhx27c       1082      3  .1922366         0         8  Told glaucoma
mdhx27d       1081      3  .2414431         0         8  Told retinopathy
mdhx27e       1082      3  .2014787         0         8  Told macular degeneration
mdhx28        1075      3  .0753488         0         8  Doctor told ulcer
mdhx28a         60      2  .0166667         0         1  Still have ulcer
mdhx29        1075      3  .1906977         0         8  Doctor told depression
mdhx29a        153      3  .8888889         0         8  Ever treated for depression
mmstot        1103     12  28.38078        19        30  
mmstotp       1103     15  28.38504        19        30  
dsstag        1137     10  71.53738        70        99  
dsstot        1094     70   41.3309         9        87  
age           1154   1114  74.14515  22.41478  100.8214  
simtot        1131     22  21.21485         0        27  Similar Total score
wrttot        1132     23  50.59541        22        57  WRAT Total
boscor         988     37  53.93219        18        94  BostonNaming - # correct of 60
incg          1162      1         1         1         1  
inms             0      0         .         .         .  
ms               0      0         .         .         .  
tr_exec       1091    163  52.48579       -13       272  
trbts_log     1093    181  1.887298  1.380211  2.477121  
tr_exec_log   1080    157  1.636815         0  2.434569  
sens_cog_tag  1162      2  .0120482         0         1  
cestag           0      0         .         .         .  
mmstag           0      0         .         .         .  
home_visit       0      0         .         .         .  Flag to indicate visit was at home (Y)
visacdate     1064    491  20605.07     20100     21142  Visual Acuity Test Date
logmar_pbe    1054     48  .1924099      -.16       1.1  LOGMAR VA IN BE USING PVA
pva2040       1054      2  .2533207         0         1  PREST VA worse than 20/40
logmar_pbe10  1054     48  1.924099      -1.6        11  LOGMAR PVA IN BE PER 01.0 CHANGE
logmar_bcbe   1054     45  .0955741      -.16         1  LOGMAR VA IN BCBE
logmar_bc~10  1054     45  .9557407      -1.6        10  LOGMAR VA IN BCBE PER 0.10 CHANGE
va2040        1054      2  .1242884         0         1  VA worse than 20/40 USING BCBE VA
uncor_re      1054      2  .7267552         0         1  UNCORRECTED REFRACTIVE ERROR
contrast      1053      9  1.881909       .75       2.1  LOGCS
cs155         1053      2  .0275404         0         1  CS WORSE THAN 155
contrast10    1053      9  18.81909       7.5        21  LOGCS PER 01.0 CHANGE
sa_min         948      9   75.7173        40       800  MINIMUM SA SEEN
sa80           948      2  .1223629         0         1  SA WORSE THAN (>) 80 SEC OF ARC
vision_visit  1067      3  1.304592         1         3  VISIT W NEW VIS PROTOCOL
typevis       1067      1         1         1         1  
visit_date     907    437   20599.9     19807     21143  visit_date
missed         907     26  2.124587         0        54  TOTAL # POINTES MISSED IN ALL FIELDS
cen            907     12  .4950386         0        31  # POINTS MISSED IN CENTRAL 20 DEGREES OF VIS FIELD
perup          907     14  1.128997         0        13  # POINTS MISSED IN UPPER PERIPHERAL VIS FIELD
perlo          907     11  .5005513         0        10  # POINTS MISSED IN LOWER PERIPHERAL VIS FIELD
vf_impaired    907      2   .061742         0         1  MISSED >1SD OF POP MEAN (>6.5 PTS MISSED)
vf_visit       907      6  2.690187         1         6  
visvfdon      1032      2  .8614341         0         1  _VISVFDON_1436
visvfrnd       140      5  707.2286       555       999  _VISVFRND_963
ina           1083      2  .9852262         0         1  
invf          1083      1         1         1         1  
bmi           1081    783   27.0131     16.87     52.45  ANTH: Body Mass Index
smokehx       1051      4  .3672693         0         3  SMOK: Smoking history
homevisit     1083      1         0         0         0  
cesd          1071     30  5.270775         0        32  CES Depression score
cescut16      1071      2   .054155         0         1  CES Symptoms of depression
cescut20      1071      2  .0233427         0         1  CES Significant symptoms of depression
sbp           1060     86  118.0755        70       192  Composed Systolic blood pressure (mmHg)
dbp           1060     49  66.99245        45        94  Composed Diastolic blood pressure (mmHg)
oact01        1068      3  .3501873         0         8  Currently works
male          1083      2  .4635272         0         1  
dod              5      2   20875.2     20847     20894  Date of Death
racecd        1080      9  1.409259         0         9  Race
educat        1069      5  3.400374         0         4  Education category (highest attained)
black         1083      2  .2640813         0         1  
indm          1083      1         1         1         1  
invs          1083      1         1         1         1  
_merge        1164      3  2.859107         1         3  
---------------------------------------------------------------------------------------------------------------------------------------------------------------

. duplicates report idno 

Duplicates in terms of idno

--------------------------------------
   copies | observations       surplus
----------+---------------------------
        1 |          555             0
        2 |          414           207
        3 |          195           130
--------------------------------------

. 
. 
end of do-file

. return list

scalars:
       r(unique_value) =  827
                  r(N) =  1164

. di r(varlist)
.

. help varlist

. do "C:\Users\sdu7\AppData\Local\Temp\STD3e04_000000.tmp"

. local vis :logmar_bcbe10 cont10_inv missed sa_min 
logmar_bcbe10 not allowed
r(101);

end of do-file

r(101);

. help local

. help local

. do "C:\Users\sdu7\AppData\Local\Temp\STD3e04_000000.tmp"

. local vis of varlist logmar_bcbe10 cont10_inv missed sa_min 

. 
end of do-file

. di `vis'


. codebook `vis
` invalid name
r(198);

. codebook `vis'

---------------------------------------------------------------------------------------------------------------------------------------------------------------
idno                                                                                                                                                 BLSA ID NO
---------------------------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (double)

                 range:  [270,7996]                   units:  1
         unique values:  827                      missing .:  0/1,164

                  mean:   4991.77
              std. dev:   2239.73

           percentiles:        10%       25%       50%       75%       90%
                              1418    4649.5      5231      6210      7769

---------------------------------------------------------------------------------------------------------------------------------------------------------------
visit                                                                                                                                              Visit Number
---------------------------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (double)

                 range:  [1,31]                       units:  1
         unique values:  31                       missing .:  0/1,164

                  mean:    7.5378
              std. dev:    5.8931

           percentiles:        10%       25%       50%       75%       90%
                                 1         3         6        10        17

---------------------------------------------------------------------------------------------------------------------------------------------------------------
dov                                                                                                                                               Date of Visit
---------------------------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric daily date (long)

                 range:  [10974,21158]                units:  1
       or equivalently:  [17jan1990,05dec2017]        units:  days
         unique values:  457                      missing .:  0/1,164

                  mean:   20602.4 = 28may2016 (+ 10 hours)
              std. dev:   530.439

           percentiles:        10%       25%       50%       75%       90%
                             20197   20352.5     20636     20885     21045
                         19apr2015 21sep2015 01jul2016 07mar2017 14aug2017

---------------------------------------------------------------------------------------------------------------------------------------------------------------
cvlifr1tag                                                                                                                        CVL Missing data tag for IFR1
---------------------------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (double)

                 range:  [70,99]                      units:  1
         unique values:  12                       missing .:  26/1,164

                  mean:   71.5633
              std. dev:   5.08502

           percentiles:        10%       25%       50%       75%       90%
                                70        70        70        70        77

---------------------------------------------------------------------------------------------------------------------------------------------------------------
cvlifr2tag                                                                                                                        CVL Missing data tag for IFR2
---------------------------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (double)

                 range:  [70,99]                      units:  1
         unique values:  12                       missing .:  26/1,164

                  mean:   71.5879
              std. dev:   5.14484

           percentiles:        10%       25%       50%       75%       90%
                                70        70        70        70        77

---------------------------------------------------------------------------------------------------------------------------------------------------------------
cvlifr3tag                                                                                                                        CVL Missing data tag for IFR3
---------------------------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (double)

                 range:  [70,99]                      units:  1
         unique values:  11                       missing .:  26/1,164

                  mean:   71.6134
              std. dev:   5.20502

           percentiles:        10%       25%       50%       75%       90%
                                70        70        70        70        77

---------------------------------------------------------------------------------------------------------------------------------------------------------------
cvlifr4tag                                                                                                                        CVL Missing data tag for IFR4
---------------------------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (double)

                 range:  [70,99]                      units:  1
         unique values:  11                       missing .:  26/1,164

                  mean:   71.6054
              std. dev:   5.20062

           percentiles:        10%       25%       50%       75%       90%
                                70        70        70        70        77

---------------------------------------------------------------------------------------------------------------------------------------------------------------
cvlifr5tag                                                                                                                        CVL Missing data tag for IFR5
---------------------------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (double)

                 range:  [70,99]                      units:  1
         unique values:  11                       missing .:  26/1,164

                  mean:   71.6054
              std. dev:   5.20062

           percentiles:        10%       25%       50%       75%       90%
                                70        70        70        70        77

---------------------------------------------------------------------------------------------------------------------------------------------------------------
cvlifrbtag                                                                                                                        CVL Missing data tag for IFRB
---------------------------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (double)

                 range:  [70,99]                      units:  1
         unique values:  11                       missing .:  26/1,164

                  mean:   71.6344
              std. dev:     5.263

           percentiles:        10%       25%       50%       75%       90%
                                70        70        70        70        77

---------------------------------------------------------------------------------------------------------------------------------------------------------------
cvlsdfrtag                                                                                                                        CVL Missing data tag for SDFR
---------------------------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (double)

                 range:  [70,99]                      units:  1
         unique values:  11                       missing .:  26/1,164

                  mean:   71.6714
              std. dev:   5.32869

           percentiles:        10%       25%       50%       75%       90%
                                70        70        70        70        77

---------------------------------------------------------------------------------------------------------------------------------------------------------------
cvlsdcrtag                                                                                                                        CVL Missing data tag for SDCR
---------------------------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (double)

                 range:  [70,99]                      units:  1
         unique values:  11                       missing .:  26/1,164

                  mean:   71.6591
              std. dev:   5.32049

           percentiles:        10%       25%       50%       75%       90%
                                70        70        70        70        77

---------------------------------------------------------------------------------------------------------------------------------------------------------------
cvlldfrtag                                                                                                                        CVL Missing data tag for LDFR
---------------------------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (double)

                 range:  [70,99]                      units:  1
         unique values:  11                       missing .:  26/1,164

                  mean:   71.7364
              std. dev:   5.36782

           percentiles:        10%       25%       50%       75%       90%
                                70        70        70        70        77

---------------------------------------------------------------------------------------------------------------------------------------------------------------
cvlldcrtag                                                                                                                        CVL Missing data tag for LDCR
---------------------------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (double)

                 range:  [70,99]                      units:  1
         unique values:  11                       missing .:  26/1,164

                  mean:   71.7425
              std. dev:   5.36984

           percentiles:        10%       25%       50%       75%       90%
                                70        70        70        70        77

---------------------------------------------------------------------------------------------------------------------------------------------------------------
cvlldretag                                                                                                                        CVL Missing data tag for LDRE
---------------------------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (double)

                 range:  [7,99]                       units:  1
         unique values:  12                       missing .:  26/1,164

                  mean:   71.6793
              std. dev:   5.69836

           percentiles:        10%       25%       50%       75%       90%
                                70        70        70        70        77

---------------------------------------------------------------------------------------------------------------------------------------------------------------
cvltca                                                                                                                                      CVL Total correct A
---------------------------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (double)

                 range:  [0,80]                       units:  1
         unique values:  65                       missing .:  57/1,164

                  mean:   50.3812
              std. dev:   13.2265

           percentiles:        10%       25%       50%       75%       90%
                                33        41        50        60        68

---------------------------------------------------------------------------------------------------------------------------------------------------------------
cvlfrs                                                                                                                      CVL #Corr A Short-Delay Free Recall
---------------------------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (double)

                 range:  [0,16]                       units:  1
         unique values:  17                       missing .:  59/1,164

                  mean:   9.89412
              std. dev:   3.67456

           percentiles:        10%       25%       50%       75%       90%
                                 5         7        10        13        15

---------------------------------------------------------------------------------------------------------------------------------------------------------------
cvlfrl                                                                                                                       CVL #Corr A Long-Delay Free Recall
---------------------------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (double)

                 range:  [0,16]                       units:  1
         unique values:  17                       missing .:  59/1,164

                  mean:   10.3548
              std. dev:   3.68075

           percentiles:        10%       25%       50%       75%       90%
                                 5         8        11        13        15

---------------------------------------------------------------------------------------------------------------------------------------------------------------
flutag                                                                                                                                              Fluency tag
---------------------------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (double)

                 range:  [70,99]                      units:  1
         unique values:  10                       missing .:  25/1,164

                  mean:   71.0623
              std. dev:   3.32041

           percentiles:        10%       25%       50%       75%       90%
                                70        70        70        70        75

---------------------------------------------------------------------------------------------------------------------------------------------------------------
flucat                                                                                                                  CategFluency - mean(fruit, animal, veg)
---------------------------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (double)

                 range:  [3.3,94]                     units:  1.000e-06
         unique values:  71                       missing .:  34/1,164

                  mean:   15.4844
              std. dev:   4.49822

           percentiles:        10%       25%       50%       75%       90%
                              10.7      12.7      15.3      17.7      20.3

---------------------------------------------------------------------------------------------------------------------------------------------------------------
flulet                                                                                                                             LettrFluency - mean(F, A, S)
---------------------------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (double)

                 range:  [1,94]                       units:  1.000e-06
         unique values:  77                       missing .:  33/1,164

                  mean:   14.6839
              std. dev:   4.85433

           percentiles:        10%       25%       50%       75%       90%
                               9.3      11.7      14.7      17.3        20

---------------------------------------------------------------------------------------------------------------------------------------------------------------
fortag                                                                                                                   WAIS-R Digits Forward Special data tag
---------------------------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (double)

                 range:  [70,99]                      units:  1
         unique values:  11                       missing .:  23/1,164

                  mean:   70.9089
              std. dev:   4.51222

           percentiles:        10%       25%       50%       75%       90%
                                70        70        70        70        70

---------------------------------------------------------------------------------------------------------------------------------------------------------------
bcktag                                                                                                                  WAIS-R Digits Backward Special data tag
---------------------------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (double)

                 range:  [70,99]                      units:  1
         unique values:  11                       missing .:  24/1,164

                  mean:   71.0509
              std. dev:   4.92232

           percentiles:        10%       25%       50%       75%       90%
                                70        70        70        70        70

---------------------------------------------------------------------------------------------------------------------------------------------------------------
digfor                                                                                                                  WAIS-R Digits Forward Traditional score
---------------------------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (double)

                 range:  [0,14]                       units:  1
         unique values:  14                       missing .:  57/1,164

                  mean:   8.06233
              std. dev:    2.2475

           percentiles:        10%       25%       50%       75%       90%
                                 5         6         8        10        11

---------------------------------------------------------------------------------------------------------------------------------------------------------------
digbac                                                                                                                 WAIS-R Digits Backward Traditional score
---------------------------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (double)

                 range:  [0,14]                       units:  1
         unique values:  15                       missing .:  63/1,164

                  mean:   7.01544
              std. dev:   2.20717

           percentiles:        10%       25%       50%       75%       90%
                                 4         6         7         8        10

---------------------------------------------------------------------------------------------------------------------------------------------------------------
trailstag                                                                                                                                                 NPTAG
---------------------------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (double)

                 range:  [70,99]                      units:  1
         unique values:  10                       missing .:  25/1,164

                  mean:   71.0211
              std. dev:   3.30488

           percentiles:        10%       25%       50%       75%       90%
                                70        70        70        70        75

---------------------------------------------------------------------------------------------------------------------------------------------------------------
trats                                                                                                                                 Trails - A test (seconds)
---------------------------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (double)

                 range:  [10,300]                     units:  1
         unique values:  80                       missing .:  38/1,164

                  mean:   34.4361
              std. dev:   20.8976

           percentiles:        10%       25%       50%       75%       90%
                                20        24        31        39        49

---------------------------------------------------------------------------------------------------------------------------------------------------------------
trbts                                                                                                                                 Trails - B test (seconds)
---------------------------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (double)

                 range:  [24,300]                     units:  1
         unique values:  181                      missing .:  71/1,164

                  mean:   86.1793
              std. dev:    46.219

           percentiles:        10%       25%       50%       75%       90%
                                45        56        74       101       140

---------------------------------------------------------------------------------------------------------------------------------------------------------------
crdtag                                                                                                                         Card Rotations: Special data tag
---------------------------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (double)

                 range:  [70,99]                      units:  1
         unique values:  11                       missing .:  53/1,164

                  mean:   71.2169
              std. dev:   5.21214

           percentiles:        10%       25%       50%       75%       90%
                                70        70        70        70        70

---------------------------------------------------------------------------------------------------------------------------------------------------------------
crdrot                                                                                                          Card Rotations: Total score (correct-incorrect)
---------------------------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (double)

                 range:  [-7,204]                     units:  1
         unique values:  185                      missing .:  89/1,164

                  mean:   83.9153
              std. dev:   41.3946

           percentiles:        10%       25%       50%       75%       90%
                                33        54        79       110       140

---------------------------------------------------------------------------------------------------------------------------------------------------------------
clktag                                                                                                                                            Neuro Clk tag
---------------------------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (double)

                 range:  [70,99]                      units:  1
         unique values:  10                       missing .:  170/1,164

                  mean:   71.1207
              std. dev:   3.38552

           percentiles:        10%       25%       50%       75%       90%
                                70        70        70        70        75

---------------------------------------------------------------------------------------------------------------------------------------------------------------
clk325                                                                                                                                               Clock 3:25
---------------------------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (double)

                 range:  [0,10]                       units:  1
         unique values:  9                        missing .:  180/1,164

            tabulation:  Freq.  Value
                             4  0
                             2  3
                             5  4
                            16  5
                            34  6
                            89  7
                           235  8
                           434  9
                           165  10
                           180  .

---------------------------------------------------------------------------------------------------------------------------------------------------------------
clk1110                                                                                                                                             Clock 11:10
---------------------------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (double)

                 range:  [0,10]                       units:  1
         unique values:  8                        missing .:  180/1,164

            tabulation:  Freq.  Value
                             4  0
                             3  4
                            11  5
                            28  6
                            63  7
                           178  8
                           260  9
                           437  10
                           180  .

---------------------------------------------------------------------------------------------------------------------------------------------------------------
bvrtag                                                                                                                                                  BVR Tag
---------------------------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (double)

                 range:  [70,99]                      units:  1
         unique values:  9                        missing .:  54/1,164

            tabulation:  Freq.  Value
                         1,032  70
                            13  74
                             1  76
                            43  77
                             8  79
                             4  96
                             4  97
                             1  98
                             4  99
                            54  .

---------------------------------------------------------------------------------------------------------------------------------------------------------------
bvrtot                                                                                                                                         BVR Total errors
---------------------------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (double)

                 range:  [0,27]                       units:  1
         unique values:  28                       missing .:  64/1,164

                  mean:   10.4155
              std. dev:   5.56009

           percentiles:        10%       25%       50%       75%       90%
                                 3         6        10        15        18

---------------------------------------------------------------------------------------------------------------------------------------------------------------
oact06a                                                                                                                            Freq do word puzzles past yr
---------------------------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (double)

                 range:  [0,8]                        units:  1
         unique values:  6                        missing .:  92/1,164

            tabulation:  Freq.  Value
                           514  0
                           142  1
                            67  2
                           107  3
                           240  4
                             2  8
                            92  .

---------------------------------------------------------------------------------------------------------------------------------------------------------------
oact06b                                                                                                                          Freq do jigsaw puzzles past yr
---------------------------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (double)

                 range:  [0,8]                        units:  1
         unique values:  6                        missing .:  93/1,164

            tabulation:  Freq.  Value
                           783  0
                           193  1
                            32  2
                            42  3
                            20  4
                             1  8
                            93  .

---------------------------------------------------------------------------------------------------------------------------------------------------------------
oact06c                                                                                                                           Freq read periodicals past yr
---------------------------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (double)

                 range:  [0,8]                        units:  1
         unique values:  7                        missing .:  92/1,164

            tabulation:  Freq.  Value
                            21  0
                            15  1
                            27  2
                           159  3
                           848  4
                             1  7
                             1  8
                            92  .

---------------------------------------------------------------------------------------------------------------------------------------------------------------
oact06d                                                                                                                                 Freq read books past yr
---------------------------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (double)

                 range:  [0,8]                        units:  1
         unique values:  7                        missing .:  92/1,164

            tabulation:  Freq.  Value
                            61  0
                           100  1
                            63  2
                           235  3
                           610  4
                             1  7
                             2  8
                            92  .

---------------------------------------------------------------------------------------------------------------------------------------------------------------
oact06e                                                                                                                   Freq play board or card games past yr
---------------------------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (double)

                 range:  [0,8]                        units:  1
         unique values:  6                        missing .:  95/1,164

            tabulation:  Freq.  Value
                           519  0
                           205  1
                           113  2
                           177  3
                            54  4
                             1  8
                            95  .

---------------------------------------------------------------------------------------------------------------------------------------------------------------
oact06f                                                                                                                             Freq use a computer past yr
---------------------------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (double)

                 range:  [0,8]                        units:  1
         unique values:  6                        missing .:  93/1,164

            tabulation:  Freq.  Value
                            61  0
                            13  1
                            14  2
                            69  3
                           913  4
                             1  8
                            93  .

---------------------------------------------------------------------------------------------------------------------------------------------------------------
oact06g                                                                                                                  Freq play a musical instrument past yr
---------------------------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (double)

                 range:  [0,8]                        units:  1
         unique values:  7                        missing .:  93/1,164

            tabulation:  Freq.  Value
                           921  0
                            65  1
                            26  2
                            35  3
                            22  4
                             1  7
                             1  8
                            93  .

---------------------------------------------------------------------------------------------------------------------------------------------------------------
oact06i                                                                                                                             Freq write anything past yr
---------------------------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (double)

                 range:  [0,8]                        units:  1
         unique values:  6                        missing .:  99/1,164

            tabulation:  Freq.  Value
                           385  0
                           225  1
                           120  2
                           173  3
                           160  4
                             2  8
                            99  .

---------------------------------------------------------------------------------------------------------------------------------------------------------------
oact06k                                                                                                                                  Freq do crafts past yr
---------------------------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (double)

                 range:  [0,8]                        units:  1
         unique values:  6                        missing .:  94/1,164

            tabulation:  Freq.  Value
                           615  0
                           215  1
                           111  2
                            89  3
                            39  4
                             1  8
                            94  .

---------------------------------------------------------------------------------------------------------------------------------------------------------------
oact06l                                                                                                                                 Freq do artwork past yr
---------------------------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (double)

                 range:  [0,8]                        units:  1
         unique values:  6                        missing .:  93/1,164

            tabulation:  Freq.  Value
                           745  0
                           142  1
                            78  2
                            88  3
                            17  4
                             1  8
                            93  .

---------------------------------------------------------------------------------------------------------------------------------------------------------------
ca_sum                                                                                                                                              (unlabeled)
---------------------------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (double)

                 range:  [1,72]                       units:  1
         unique values:  31                       missing .:  92/1,164

                  mean:   16.1549
              std. dev:   4.80063

           percentiles:        10%       25%       50%       75%       90%
                                11        13        16        19        22

---------------------------------------------------------------------------------------------------------------------------------------------------------------
ca_ratio                                                                                                                                            (unlabeled)
---------------------------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (double)

                 range:  [.11111111,8]                units:  1.000e-08
         unique values:  40                       missing .:  92/1,164

                  mean:   1.79783
              std. dev:   .533571

           percentiles:        10%       25%       50%       75%       90%
                           1.22222   1.44444   1.77778   2.11111   2.44444

---------------------------------------------------------------------------------------------------------------------------------------------------------------
q1                                                                                                                                       CFQ need to read again
---------------------------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (double)

                 range:  [0,4]                        units:  1
         unique values:  5                        missing .:  1,001/1,164

            tabulation:  Freq.  Value
                            26  0
                            44  1
                            79  2
                            13  3
                             1  4
                         1,001  .

---------------------------------------------------------------------------------------------------------------------------------------------------------------
q2                                                                                                                   CFQ forget why went from one part to other
---------------------------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (double)

                 range:  [0,4]                        units:  1
         unique values:  5                        missing .:  1,002/1,164

            tabulation:  Freq.  Value
                            32  0
                            55  1
                            57  2
                            14  3
                             4  4
                         1,002  .

---------------------------------------------------------------------------------------------------------------------------------------------------------------
q3                                                                                                                                CFQ note signpost on the road
---------------------------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (double)

                 range:  [0,3]                        units:  1
         unique values:  4                        missing .:  1,001/1,164

            tabulation:  Freq.  Value
                            43  0
                            86  1
                            29  2
                             5  3
                         1,001  .

---------------------------------------------------------------------------------------------------------------------------------------------------------------
q4                                                                                                             CFQ confuse right and left when given directions
---------------------------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (double)

                 range:  [0,4]                        units:  1
         unique values:  5                        missing .:  1,001/1,164

            tabulation:  Freq.  Value
                            92  0
                            52  1
                            14  2
                             2  3
                             3  4
                         1,001  .

---------------------------------------------------------------------------------------------------------------------------------------------------------------
q5                                                                                                                                         CFQ bump into people
---------------------------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (double)

                 range:  [0,2]                        units:  1
         unique values:  3                        missing .:  1,002/1,164

            tabulation:  Freq.  Value
                           102  0
                            56  1
                             4  2
                         1,002  .

---------------------------------------------------------------------------------------------------------------------------------------------------------------
q6                                                                                                                  CFQ forget if turned life off/lock the door
---------------------------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (double)

                 range:  [0,4]                        units:  1
         unique values:  5                        missing .:  1,001/1,164

            tabulation:  Freq.  Value
                            42  0
                            66  1
                            48  2
                             3  3
                             4  4
                         1,001  .

---------------------------------------------------------------------------------------------------------------------------------------------------------------
q7                                                                                                                CFQ listen to peoples names when meeting them
---------------------------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (double)

                 range:  [0,4]                        units:  1
         unique values:  5                        missing .:  1,002/1,164

            tabulation:  Freq.  Value
                            18  0
                            35  1
                            65  2
                            38  3
                             6  4
                         1,002  .

---------------------------------------------------------------------------------------------------------------------------------------------------------------
q8                                                                                                CFQ say something and realize it might be taking as insulting
---------------------------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (double)

                 range:  [0,3]                        units:  1
         unique values:  4                        missing .:  1,002/1,164

            tabulation:  Freq.  Value
                            51  0
                            83  1
                            26  2
                             2  3
                         1,002  .

---------------------------------------------------------------------------------------------------------------------------------------------------------------
q9                                                                                                   CFQ fail to hear people speaking when doing something else
---------------------------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (double)

                 range:  [0,4]                        units:  1
         unique values:  5                        missing .:  1,002/1,164

            tabulation:  Freq.  Value
                            33  0
                            62  1
                            50  2
                            12  3
                             5  4
                         1,002  .

---------------------------------------------------------------------------------------------------------------------------------------------------------------
q10                                                                                                                           CFQ lose your temper and regreted
---------------------------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (double)

                 range:  [0,3]                        units:  1
         unique values:  4                        missing .:  1,002/1,164

            tabulation:  Freq.  Value
                            70  0
                            71  1
                            20  2
                             1  3
                         1,002  .

---------------------------------------------------------------------------------------------------------------------------------------------------------------
q11                                                                                                             CFQ leave important letters unanswered for days
---------------------------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (double)

                 range:  [0,3]                        units:  1
         unique values:  4                        missing .:  1,001/1,164

            tabulation:  Freq.  Value
                            70  0
                            69  1
                            22  2
                             2  3
                         1,001  .

---------------------------------------------------------------------------------------------------------------------------------------------------------------
q12                                                                                                             CFQ forget which way to turn in a road you know
---------------------------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (double)

                 range:  [0,3]                        units:  1
         unique values:  4                        missing .:  1,001/1,164

            tabulation:  Freq.  Value
                            82  0
                            57  1
                            20  2
                             4  3
                         1,001  .

---------------------------------------------------------------------------------------------------------------------------------------------------------------
q13                                                                                                            CFQ fail to see what you want in the supermarket
---------------------------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (double)

                 range:  [0,4]                        units:  1
         unique values:  5                        missing .:  1,002/1,164

            tabulation:  Freq.  Value
                            27  0
                            77  1
                            52  2
                             4  3
                             2  4
                         1,002  .

---------------------------------------------------------------------------------------------------------------------------------------------------------------
q14                                                                                                                CFQ wonder if you have used a word correctly
---------------------------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (double)

                 range:  [0,3]                        units:  1
         unique values:  4                        missing .:  1,003/1,164

            tabulation:  Freq.  Value
                            52  0
                            73  1
                            29  2
                             7  3
                         1,003  .

---------------------------------------------------------------------------------------------------------------------------------------------------------------
q15                                                                                                                             CFQ trouble making up your mind
---------------------------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (double)

                 range:  [0,4]                        units:  1
         unique values:  5                        missing .:  1,004/1,164

            tabulation:  Freq.  Value
                            42  0
                            60  1
                            50  2
                             7  3
                             1  4
                         1,004  .

---------------------------------------------------------------------------------------------------------------------------------------------------------------
q16                                                                                                                                     CFQ forget appointments
---------------------------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (double)

                 range:  [0,3]                        units:  1
         unique values:  4                        missing .:  1,003/1,164

            tabulation:  Freq.  Value
                            76  0
                            62  1
                            20  2
                             3  3
                         1,003  .

---------------------------------------------------------------------------------------------------------------------------------------------------------------
q17                                                                                                                          CFQ forget where you put something
---------------------------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (double)

                 range:  [0,4]                        units:  1
         unique values:  5                        missing .:  1,002/1,164

            tabulation:  Freq.  Value
                            19  0
                            59  1
                            64  2
                            18  3
                             2  4
                         1,002  .

---------------------------------------------------------------------------------------------------------------------------------------------------------------
q18                                                                                                   CFQ accidentally throwing away the thing you want to keep
---------------------------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (double)

                 range:  [0,3]                        units:  1
         unique values:  4                        missing .:  1,003/1,164

            tabulation:  Freq.  Value
                            98  0
                            50  1
                            12  2
                             1  3
                         1,003  .

---------------------------------------------------------------------------------------------------------------------------------------------------------------
q19                                                                                                         CFQ daydream when ought to be listenig to something
---------------------------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (double)

                 range:  [0,3]                        units:  1
         unique values:  4                        missing .:  1,002/1,164

            tabulation:  Freq.  Value
                            38  0
                            58  1
                            62  2
                             4  3
                         1,002  .

---------------------------------------------------------------------------------------------------------------------------------------------------------------
q20                                                                                                                                    CFQ forget peoples names
---------------------------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (double)

                 range:  [0,4]                        units:  1
         unique values:  5                        missing .:  1,005/1,164

            tabulation:  Freq.  Value
                             9  0
                            22  1
                            67  2
                            45  3
                            16  4
                         1,005  .

---------------------------------------------------------------------------------------------------------------------------------------------------------------
q21                                                                                      CFQ start doing one thing and get distracted into doing something else
---------------------------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (double)

                 range:  [0,3]                        units:  1
         unique values:  4                        missing .:  1,003/1,164

            tabulation:  Freq.  Value
                            34  0
                            44  1
                            55  2
                            28  3
                         1,003  .

---------------------------------------------------------------------------------------------------------------------------------------------------------------
q22                                                                                               CFQ dont remember something that is on the tip of your tongue
---------------------------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (double)

                 range:  [0,4]                        units:  1
         unique values:  5                        missing .:  1,004/1,164

            tabulation:  Freq.  Value
                             4  0
                            35  1
                            86  2
                            28  3
                             7  4
                         1,004  .

---------------------------------------------------------------------------------------------------------------------------------------------------------------
q23                                                                                                                CFQ forget what you went to the store to buy
---------------------------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (double)

                 range:  [0,4]                        units:  1
         unique values:  5                        missing .:  1,002/1,164

            tabulation:  Freq.  Value
                            57  0
                            67  1
                            31  2
                             6  3
                             1  4
                         1,002  .

---------------------------------------------------------------------------------------------------------------------------------------------------------------
q24                                                                                                                                             CFQ drop things
---------------------------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (double)

                 range:  [0,4]                        units:  1
         unique values:  5                        missing .:  1,002/1,164

            tabulation:  Freq.  Value
                            49  0
                            73  1
                            34  2
                             5  3
                             1  4
                         1,002  .

---------------------------------------------------------------------------------------------------------------------------------------------------------------
q25                                                                                                                           CFQ cant think of anything to say
---------------------------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (double)

                 range:  [0,4]                        units:  1
         unique values:  5                        missing .:  1,003/1,164

            tabulation:  Freq.  Value
                            57  0
                            59  1
                            37  2
                             6  3
                             2  4
                         1,003  .

---------------------------------------------------------------------------------------------------------------------------------------------------------------
dxatvi                                                                                                                                              (unlabeled)
---------------------------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (double)

                 range:  [-.5,1]                      units:  .1
         unique values:  4                        missing .:  83/1,164

            tabulation:  Freq.  Value
                            10  -.5
                         1,021  0
                            33  .5
                            17  1
                            83  .

---------------------------------------------------------------------------------------------------------------------------------------------------------------
smk01                                                                                                                                Ever smoked 100 cigarettes
---------------------------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (double)

                 range:  [0,1]                        units:  1
         unique values:  2                        missing .:  90/1,164

            tabulation:  Freq.  Value
                           632  0
                           442  1
                            90  .

---------------------------------------------------------------------------------------------------------------------------------------------------------------
smk01a                                                                                                                                    Ever smoked regularly
---------------------------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (double)

                 range:  [0,1]                        units:  1
         unique values:  2                        missing .:  730/1,164

            tabulation:  Freq.  Value
                            56  0
                           378  1
                           730  .

---------------------------------------------------------------------------------------------------------------------------------------------------------------
smk01b                                                                                                                                        Age began smoking
---------------------------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (double)

                 range:  [11,35]                      units:  1
         unique values:  21                       missing .:  786/1,164

                  mean:   18.6376
              std. dev:   3.71153

           percentiles:        10%       25%       50%       75%       90%
                                15        16        18        20        23

---------------------------------------------------------------------------------------------------------------------------------------------------------------
smk01c                                                                                                                               Average cigarettes per day
---------------------------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (double)

                 range:  [1,60]                       units:  1
         unique values:  22                       missing .:  788/1,164

                  mean:   14.7633
              std. dev:   11.4808

           percentiles:        10%       25%       50%       75%       90%
                                 3         5        10        20        30

---------------------------------------------------------------------------------------------------------------------------------------------------------------
smk01d                                                                                                                                    Smokes cigarettes now
---------------------------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (double)

                 range:  [0,8]                        units:  1
         unique values:  3                        missing .:  801/1,164

            tabulation:  Freq.  Value
                           351  0
                            10  1
                             2  8
                           801  .

---------------------------------------------------------------------------------------------------------------------------------------------------------------
smk01e                                                                                                                     Cigarettes currrently smoked per day
---------------------------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (double)

                 range:  [1,20]                       units:  1
         unique values:  8                        missing .:  1,154/1,164

            tabulation:  Freq.  Value
                             1  1
                             1  2
                             1  3
                             2  4
                             1  5
                             2  6
                             1  10
                             1  20
                         1,154  .

---------------------------------------------------------------------------------------------------------------------------------------------------------------
smk01f                                                                                                                              Times tried to quit smoking
---------------------------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (double)

                 range:  [0,10]                       units:  1
         unique values:  5                        missing .:  1,154/1,164

            tabulation:  Freq.  Value
                             2  0
                             5  1
                             1  2
                             1  5
                             1  10
                         1,154  .

---------------------------------------------------------------------------------------------------------------------------------------------------------------
smk01g                                                                                                                                         Age quit smoking
---------------------------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (double)

                 range:  [16,82]                      units:  1
         unique values:  50                       missing .:  802/1,164

                  mean:   37.1492
              std. dev:   12.4364

           percentiles:        10%       25%       50%       75%       90%
                                23        28        35        45        53

---------------------------------------------------------------------------------------------------------------------------------------------------------------
smk02                                                                                                                                     Ever smoked 50 cigars
---------------------------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (double)

                 range:  [0,8]                        units:  1
         unique values:  3                        missing .:  92/1,164

            tabulation:  Freq.  Value
                           993  0
                            78  1
                             1  8
                            92  .

---------------------------------------------------------------------------------------------------------------------------------------------------------------
smk02a                                                                                                                                 Age began smoking cigars
---------------------------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (double)

                 range:  [14,51]                      units:  1
         unique values:  22                       missing .:  1,086/1,164

                  mean:   27.2692
              std. dev:   8.17451

           percentiles:        10%       25%       50%       75%       90%
                                18        21        25        30        40

---------------------------------------------------------------------------------------------------------------------------------------------------------------
smk02b                                                                                                                                   Cigars smoked per week
---------------------------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (double)

                 range:  [1,50]                       units:  1
         unique values:  13                       missing .:  1,088/1,164

                  mean:   5.34211
              std. dev:   8.87927

           percentiles:        10%       25%       50%       75%       90%
                                 1         1         2       5.5        14

---------------------------------------------------------------------------------------------------------------------------------------------------------------
smk02c                                                                                                                                        Smokes cigars now
---------------------------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (double)

                 range:  [0,1]                        units:  1
         unique values:  2                        missing .:  1,091/1,164

            tabulation:  Freq.  Value
                            64  0
                             9  1
                         1,091  .

---------------------------------------------------------------------------------------------------------------------------------------------------------------
smk02d                                                                                                                               Cigars smoked now per week
---------------------------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (double)

                 range:  [1,14]                       units:  1
         unique values:  4                        missing .:  1,155/1,164

            tabulation:  Freq.  Value
                             3  1
                             3  2
                             2  7
                             1  14
                         1,155  .

---------------------------------------------------------------------------------------------------------------------------------------------------------------
smk02e                                                                                                                                  Age quit smoking cigars
---------------------------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (double)

                 range:  [19,74]                      units:  1
         unique values:  28                       missing .:  1,096/1,164

                  mean:        40
              std. dev:   13.1206

           percentiles:        10%       25%       50%       75%       90%
                                25        30        40        47        60

---------------------------------------------------------------------------------------------------------------------------------------------------------------
smk03                                                                                                                        Ever smoke 3 packages pipe tobacco
---------------------------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (double)

                 range:  [0,8]                        units:  1
         unique values:  3                        missing .:  89/1,164

            tabulation:  Freq.  Value
                           952  0
                           120  1
                             3  8
                            89  .

---------------------------------------------------------------------------------------------------------------------------------------------------------------
smk03a                                                                                                                                   Age began pipe smoking
---------------------------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (double)

                 range:  [16,51]                      units:  1
         unique values:  18                       missing .:  1,041/1,164

                  mean:   23.8455
              std. dev:   7.81658

           percentiles:        10%       25%       50%       75%       90%
                                18        19        21        25        35

---------------------------------------------------------------------------------------------------------------------------------------------------------------
smk03b                                                                                                                                 Pipefuls smoked per week
---------------------------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (double)

                 range:  [1,70]                       units:  1
         unique values:  20                       missing .:  1,043/1,164

                  mean:   10.1736
              std. dev:   12.8041

           percentiles:        10%       25%       50%       75%       90%
                                 1         2         5        14        25

---------------------------------------------------------------------------------------------------------------------------------------------------------------
smk03c                                                                                                                                          Smokes pipe now
---------------------------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (double)

                 range:  [0,1]                        units:  1
         unique values:  2                        missing .:  1,052/1,164

            tabulation:  Freq.  Value
                           109  0
                             3  1
                         1,052  .

---------------------------------------------------------------------------------------------------------------------------------------------------------------
smk03d                                                                                                                             Pipefuls smoked now per week
---------------------------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (double)

                 range:  [0,21]                       units:  1
         unique values:  2                        missing .:  1,161/1,164

            tabulation:  Freq.  Value
                             1  0
                             2  21
                         1,161  .

---------------------------------------------------------------------------------------------------------------------------------------------------------------
smk03e                                                                                                                                    Age quit pipe smoking
---------------------------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (double)

                 range:  [17,68]                      units:  1
         unique values:  31                       missing .:  1,051/1,164

                  mean:   34.7434
              std. dev:   12.2466

           percentiles:        10%       25%       50%       75%       90%
                                22        25        30        40        55

---------------------------------------------------------------------------------------------------------------------------------------------------------------
mdhx1                                                                                                                              Seen doctor since last visit
---------------------------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (double)

                 range:  [0,8]                        units:  1
         unique values:  3                        missing .:  91/1,164

            tabulation:  Freq.  Value
                            54  0
                         1,018  1
                             1  8
                            91  .

---------------------------------------------------------------------------------------------------------------------------------------------------------------
mdhx2                                                                                                                                Medical check up frequency
---------------------------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (double)

                 range:  [1,5]                        units:  1
         unique values:  5                        missing .:  89/1,164

            tabulation:  Freq.  Value
                           734  1
                           186  2
                            48  3
                            44  4
                            63  5
                            89  .

---------------------------------------------------------------------------------------------------------------------------------------------------------------
mdhx3                                                                                                                                  Doctor told heart attack
---------------------------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (double)

                 range:  [0,8]                        units:  1
         unique values:  3                        missing .:  90/1,164

            tabulation:  Freq.  Value
                         1,024  0
                            48  1
                             2  8
                            90  .

---------------------------------------------------------------------------------------------------------------------------------------------------------------
mdhx3a                                                                                                                              How long ago most recent MI
---------------------------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (double)

                 range:  [1,8]                        units:  1
         unique values:  5                        missing .:  1,126/1,164

            tabulation:  Freq.  Value
                             5  1
                             5  2
                             8  3
                            18  4
                             2  8
                         1,126  .

---------------------------------------------------------------------------------------------------------------------------------------------------------------
mdhx4                                                                                                                                           Doctor told CHF
---------------------------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (double)

                 range:  [0,8]                        units:  1
         unique values:  3                        missing .:  89/1,164

            tabulation:  Freq.  Value
                         1,052  0
                            21  1
                             2  8
                            89  .

---------------------------------------------------------------------------------------------------------------------------------------------------------------
mdhx5                                                                                                                                        Doctor told angina
---------------------------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (double)

                 range:  [0,1]                        units:  1
         unique values:  2                        missing .:  89/1,164

            tabulation:  Freq.  Value
                         1,032  0
                            43  1
                            89  .

---------------------------------------------------------------------------------------------------------------------------------------------------------------
mdhx6                                                                                                                                    Doctor told bronchitis
---------------------------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (double)

                 range:  [0,8]                        units:  1
         unique values:  3                        missing .:  89/1,164

            tabulation:  Freq.  Value
                         1,032  0
                            41  1
                             2  8
                            89  .

---------------------------------------------------------------------------------------------------------------------------------------------------------------
mdhx7                                                                                                                                        Doctor told asthma
---------------------------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (double)

                 range:  [0,8]                        units:  1
         unique values:  3                        missing .:  89/1,164

            tabulation:  Freq.  Value
                           980  0
                            91  1
                             4  8
                            89  .

---------------------------------------------------------------------------------------------------------------------------------------------------------------
mdhx7a                                                                                                                                        Still have asthma
---------------------------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (double)

                 range:  [0,8]                        units:  1
         unique values:  3                        missing .:  1,077/1,164

            tabulation:  Freq.  Value
                            35  0
                            49  1
                             3  8
                         1,077  .

---------------------------------------------------------------------------------------------------------------------------------------------------------------
mdhx8                                                                                                                                     Doctor told cirrhosis
---------------------------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (double)

                 range:  [0,8]                        units:  1
         unique values:  3                        missing .:  89/1,164

            tabulation:  Freq.  Value
                         1,068  0
                             6  1
                             1  8
                            89  .

---------------------------------------------------------------------------------------------------------------------------------------------------------------
mdhx9                                                                                                                                     Doctor told hepatitis
---------------------------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (double)

                 range:  [0,8]                        units:  1
         unique values:  3                        missing .:  89/1,164

            tabulation:  Freq.  Value
                         1,021  0
                            53  1
                             1  8
                            89  .

---------------------------------------------------------------------------------------------------------------------------------------------------------------
mdhx10                                                                                                                                  Doctor told HIV or AIDS
---------------------------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (double)

                 range:  [0,0]                        units:  1
         unique values:  1                        missing .:  89/1,164

            tabulation:  Freq.  Value
                         1,075  0
                            89  .

---------------------------------------------------------------------------------------------------------------------------------------------------------------
mdhx11                                                                                                                               Doctor told kidney disease
---------------------------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (double)

                 range:  [0,8]                        units:  1
         unique values:  3                        missing .:  88/1,164

            tabulation:  Freq.  Value
                         1,029  0
                            46  1
                             1  8
                            88  .

---------------------------------------------------------------------------------------------------------------------------------------------------------------
mdhx12                                                                                                                                       Doctor told stroke
---------------------------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (double)

                 range:  [0,8]                        units:  1
         unique values:  3                        missing .:  87/1,164

            tabulation:  Freq.  Value
                         1,037  0
                            35  1
                             5  8
                            87  .

---------------------------------------------------------------------------------------------------------------------------------------------------------------
mdhx12a                                                                                                                         How long ago most recent stroke
---------------------------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (double)

                 range:  [1,8]                        units:  1
         unique values:  5                        missing .:  1,124/1,164

            tabulation:  Freq.  Value
                            11  1
                             3  2
                             5  3
                            20  4
                             1  8
                         1,124  .

---------------------------------------------------------------------------------------------------------------------------------------------------------------
mdhx13                                                                                                                                          Doctor told TIA
---------------------------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (double)

                 range:  [0,8]                        units:  1
         unique values:  3                        missing .:  86/1,164

            tabulation:  Freq.  Value
                         1,024  0
                            47  1
                             7  8
                            86  .

---------------------------------------------------------------------------------------------------------------------------------------------------------------
mdhx13a                                                                                                                            How long ago most recent TIA
---------------------------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (double)

                 range:  [1,8]                        units:  1
         unique values:  5                        missing .:  1,117/1,164

            tabulation:  Freq.  Value
                            13  1
                             1  2
                            10  3
                            22  4
                             1  8
                         1,117  .

---------------------------------------------------------------------------------------------------------------------------------------------------------------
mdhx14                                                                                                                        Doctor told peripheral neuropathy
---------------------------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (double)

                 range:  [0,8]                        units:  1
         unique values:  3                        missing .:  89/1,164

            tabulation:  Freq.  Value
                           945  0
                           115  1
                            15  8
                            89  .

---------------------------------------------------------------------------------------------------------------------------------------------------------------
mdhx15                                                                                                                                   Ever told hypertensive
---------------------------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (double)

                 range:  [0,8]                        units:  1
         unique values:  3                        missing .:  83/1,164

            tabulation:  Freq.  Value
                           547  0
                           531  1
                             3  8
                            83  .

---------------------------------------------------------------------------------------------------------------------------------------------------------------
mdhx15a                                                                                                                      Taking medication for hypertension
---------------------------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (double)

                 range:  [0,1]                        units:  1
         unique values:  2                        missing .:  646/1,164

            tabulation:  Freq.  Value
                            69  0
                           449  1
                           646  .

---------------------------------------------------------------------------------------------------------------------------------------------------------------
mdhx15b                                                                                                                                 Still have hypertension
---------------------------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (double)

                 range:  [0,8]                        units:  1
         unique values:  3                        missing .:  1,062/1,164

            tabulation:  Freq.  Value
                            70  0
                            28  1
                             4  8
                         1,062  .

---------------------------------------------------------------------------------------------------------------------------------------------------------------
mdhx15c                                                                                                                       Lifestyle change for hypertension
---------------------------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (double)

                 range:  [0,1]                        units:  1
         unique values:  2                        missing .:  647/1,164

            tabulation:  Freq.  Value
                            64  0
                           453  1
                           647  .

---------------------------------------------------------------------------------------------------------------------------------------------------------------
mdhx16                                                                                                                                     Doctor told diabetes
---------------------------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (double)

                 range:  [0,8]                        units:  1
         unique values:  3                        missing .:  85/1,164

            tabulation:  Freq.  Value
                           899  0
                           176  1
                             4  8
                            85  .

---------------------------------------------------------------------------------------------------------------------------------------------------------------
mdhx16a                                                                                                                          Taking medication for diabetes
---------------------------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (double)

                 range:  [0,8]                        units:  1
         unique values:  3                        missing .:  990/1,164

            tabulation:  Freq.  Value
                           101  0
                            72  1
                             1  8
                           990  .

---------------------------------------------------------------------------------------------------------------------------------------------------------------
mdhx16b                                                                                                                                     Still have diabetes
---------------------------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (double)

                 range:  [0,8]                        units:  1
         unique values:  3                        missing .:  1,073/1,164

            tabulation:  Freq.  Value
                            54  0
                            21  1
                            16  8
                         1,073  .

---------------------------------------------------------------------------------------------------------------------------------------------------------------
mdhx16c                                                                                                                           Lifestyle change for diabetes
---------------------------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (double)

                 range:  [0,8]                        units:  1
         unique values:  3                        missing .:  995/1,164

            tabulation:  Freq.  Value
                            19  0
                           148  1
                             2  8
                           995  .

---------------------------------------------------------------------------------------------------------------------------------------------------------------
mdhx17                                                                                                                                   High blood cholesterol
---------------------------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (double)

                 range:  [0,8]                        units:  1
         unique values:  3                        missing .:  84/1,164

            tabulation:  Freq.  Value
                           426  0
                           646  1
                             8  8
                            84  .

---------------------------------------------------------------------------------------------------------------------------------------------------------------
mdhx17b                                                                                                                             Still have high cholesterol
---------------------------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (double)

                 range:  [0,8]                        units:  1
         unique values:  3                        missing .:  877/1,164

            tabulation:  Freq.  Value
                           127  0
                            93  1
                            67  8
                           877  .

---------------------------------------------------------------------------------------------------------------------------------------------------------------
mdhx17c                                                                                                                       Lifestyle change for lipid levels
---------------------------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (double)

                 range:  [0,8]                        units:  1
         unique values:  3                        missing .:  541/1,164

            tabulation:  Freq.  Value
                            82  0
                           538  1
                             3  8
                           541  .

---------------------------------------------------------------------------------------------------------------------------------------------------------------
mdhx18                                                                                                                         Ever had any vascular procedures
---------------------------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (double)

                 range:  [0,1]                        units:  1
         unique values:  2                        missing .:  90/1,164

            tabulation:  Freq.  Value
                         1,002  0
                            72  1
                            90  .

---------------------------------------------------------------------------------------------------------------------------------------------------------------
mdhx18a1                                                                                                                                               Had CABG
---------------------------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (double)

                 range:  [0,1]                        units:  1
         unique values:  2                        missing .:  263/1,164

            tabulation:  Freq.  Value
                           868  0
                            33  1
                           263  .

---------------------------------------------------------------------------------------------------------------------------------------------------------------
mdhx18a2                                                                                                                                        Had angioplasty
---------------------------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (double)

                 range:  [0,1]                        units:  1
         unique values:  2                        missing .:  270/1,164

            tabulation:  Freq.  Value
                           860  0
                            34  1
                           270  .

---------------------------------------------------------------------------------------------------------------------------------------------------------------
mdhx18a3                                                                                                                                 Had leg bypass surgery
---------------------------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (double)

                 range:  [0,1]                        units:  1
         unique values:  2                        missing .:  272/1,164

            tabulation:  Freq.  Value
                           884  0
                             8  1
                           272  .

---------------------------------------------------------------------------------------------------------------------------------------------------------------
mdhx18a4                                                                                                                                    Had leg angioplasty
---------------------------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (double)

                 range:  [0,1]                        units:  1
         unique values:  2                        missing .:  272/1,164

            tabulation:  Freq.  Value
                           880  0
                            12  1
                           272  .

---------------------------------------------------------------------------------------------------------------------------------------------------------------
mdhx18a5                                                                                                                              Had carotid endaterectomy
---------------------------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (double)

                 range:  [0,1]                        units:  1
         unique values:  2                        missing .:  272/1,164

            tabulation:  Freq.  Value
                           884  0
                             8  1
                           272  .

---------------------------------------------------------------------------------------------------------------------------------------------------------------
mdhx18a6                                                                                                                                    Had aneurysm repair
---------------------------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (double)

                 range:  [0,1]                        units:  1
         unique values:  2                        missing .:  272/1,164

            tabulation:  Freq.  Value
                           889  0
                             3  1
                           272  .

---------------------------------------------------------------------------------------------------------------------------------------------------------------
mdhx19                                                                                                                                       Doctor told cancer
---------------------------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (double)

                 range:  [0,8]                        units:  1
         unique values:  3                        missing .:  89/1,164

            tabulation:  Freq.  Value
                           703  0
                           370  1
                             2  8
                            89  .

---------------------------------------------------------------------------------------------------------------------------------------------------------------
mdh19a1                                                                                                                                          Bladder cancer
---------------------------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (double)

                 range:  [0,1]                        units:  1
         unique values:  2                        missing .:  82/1,164

            tabulation:  Freq.  Value
                         1,077  0
                             5  1
                            82  .

---------------------------------------------------------------------------------------------------------------------------------------------------------------
mdh19b1                                                                                                                              Age dx with bladder cancer
---------------------------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (double)

                 range:  [59,999]                     units:  1
         unique values:  5                        missing .:  272/1,164

            tabulation:  Freq.  Value
                             1  59
                             1  62
                             1  72
                             2  76
                           887  999
                           272  .

---------------------------------------------------------------------------------------------------------------------------------------------------------------
mdh19a2                                                                                                                                            Brain cancer
---------------------------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (double)

                 range:  [0,1]                        units:  1
         unique values:  2                        missing .:  82/1,164

            tabulation:  Freq.  Value
                         1,080  0
                             2  1
                            82  .

---------------------------------------------------------------------------------------------------------------------------------------------------------------
mdh19b2                                                                                                                                Age dx with brain cancer
---------------------------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (double)

                 range:  [11,999]                     units:  1
         unique values:  4                        missing .:  274/1,164

            tabulation:  Freq.  Value
                             1  11
                             1  44
                             1  89
                           887  999
                           274  .

---------------------------------------------------------------------------------------------------------------------------------------------------------------
mdh19a3                                                                                                                                           Breast cancer
---------------------------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (double)

                 range:  [0,1]                        units:  1
         unique values:  2                        missing .:  82/1,164

            tabulation:  Freq.  Value
                         1,045  0
                            37  1
                            82  .

---------------------------------------------------------------------------------------------------------------------------------------------------------------
mdh19b3                                                                                                                               Age dx with breast cancer
---------------------------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (double)

                 range:  [12,999]                     units:  1
         unique values:  23                       missing .:  268/1,164

                  mean:    960.27
              std. dev:   186.739

           percentiles:        10%       25%       50%       75%       90%
                               999       999       999       999       999

---------------------------------------------------------------------------------------------------------------------------------------------------------------
mdh19a4                                                                                                                                         Cervical cancer
---------------------------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (double)

                 range:  [0,1]                        units:  1
         unique values:  2                        missing .:  82/1,164

            tabulation:  Freq.  Value
                         1,078  0
                             4  1
                            82  .

---------------------------------------------------------------------------------------------------------------------------------------------------------------
mdh19b4                                                                                                                             Age dx with cervical cancer
---------------------------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (double)

                 range:  [21,999]                     units:  1
         unique values:  4                        missing .:  274/1,164

            tabulation:  Freq.  Value
                             1  21
                             2  34
                             1  62
                           886  999
                           274  .

---------------------------------------------------------------------------------------------------------------------------------------------------------------
mdh19a5                                                                                                                                            Colon cancer
---------------------------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (double)

                 range:  [0,1]                        units:  1
         unique values:  2                        missing .:  82/1,164

            tabulation:  Freq.  Value
                         1,073  0
                             9  1
                            82  .

---------------------------------------------------------------------------------------------------------------------------------------------------------------
mdh19b5                                                                                                                                Age dx with colon cancer
---------------------------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (double)

                 range:  [38,999]                     units:  1
         unique values:  10                       missing .:  272/1,164

                  mean:   989.504
              std. dev:   94.1158

           percentiles:        10%       25%       50%       75%       90%
                               999       999       999       999       999

---------------------------------------------------------------------------------------------------------------------------------------------------------------
mdh19a6                                                                                                                                      Endometrial cancer
---------------------------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (double)

                 range:  [0,1]                        units:  1
         unique values:  2                        missing .:  82/1,164

            tabulation:  Freq.  Value
                         1,077  0
                             5  1
                            82  .

---------------------------------------------------------------------------------------------------------------------------------------------------------------
mdh19b6                                                                                                                          Age dx with endometrial cancer
---------------------------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (double)

                 range:  [54,999]                     units:  1
         unique values:  6                        missing .:  273/1,164

            tabulation:  Freq.  Value
                             1  54
                             1  55
                             1  57
                             1  59
                             1  64
                           886  999
                           273  .

---------------------------------------------------------------------------------------------------------------------------------------------------------------
mdh19a7                                                                                                                                                Leukemia
---------------------------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (double)

                 range:  [0,1]                        units:  1
         unique values:  2                        missing .:  82/1,164

            tabulation:  Freq.  Value
                         1,079  0
                             3  1
                            82  .

---------------------------------------------------------------------------------------------------------------------------------------------------------------
mdh19b7                                                                                                                                    Age dx with leukemia
---------------------------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (double)

                 range:  [79,999]                     units:  1
         unique values:  3                        missing .:  273/1,164

            tabulation:  Freq.  Value
                             1  79
                             2  83
                           888  999
                           273  .

---------------------------------------------------------------------------------------------------------------------------------------------------------------
mdh19a8                                                                                                                                            Liver cancer
---------------------------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (double)

                 range:  [0,0]                        units:  1
         unique values:  1                        missing .:  82/1,164

            tabulation:  Freq.  Value
                         1,082  0
                            82  .

---------------------------------------------------------------------------------------------------------------------------------------------------------------
mdh19b8                                                                                                                                Age dx with liver cancer
---------------------------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (double)

                 range:  [999,999]                    units:  1
         unique values:  1                        missing .:  273/1,164

            tabulation:  Freq.  Value
                           891  999
                           273  .

---------------------------------------------------------------------------------------------------------------------------------------------------------------
mdh19a9                                                                                                                                             Lung cancer
---------------------------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (double)

                 range:  [0,1]                        units:  1
         unique values:  2                        missing .:  82/1,164

            tabulation:  Freq.  Value
                         1,079  0
                             3  1
                            82  .

---------------------------------------------------------------------------------------------------------------------------------------------------------------
mdh19b9                                                                                                                                 Age dx with lung cancer
---------------------------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (double)

                 range:  [57,999]                     units:  1
         unique values:  4                        missing .:  272/1,164

            tabulation:  Freq.  Value
                             1  57
                             1  72
                             1  85
                           889  999
                           272  .

---------------------------------------------------------------------------------------------------------------------------------------------------------------
mdh19a10                                                                                                                                               Lymphoma
---------------------------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (double)

                 range:  [0,1]                        units:  1
         unique values:  2                        missing .:  82/1,164

            tabulation:  Freq.  Value
                         1,071  0
                            11  1
                            82  .

---------------------------------------------------------------------------------------------------------------------------------------------------------------
mdh19b10                                                                                                                                   Age dx with lymphoma
---------------------------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (double)

                 range:  [63,999]                     units:  1
         unique values:  8                        missing .:  270/1,164

            tabulation:  Freq.  Value
                             2  63
                             2  65
                             2  74
                             1  75
                             1  76
                             1  84
                             2  87
                           883  999
                           270  .

---------------------------------------------------------------------------------------------------------------------------------------------------------------
mdh19a11                                                                                                                                               Melanoma
---------------------------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (double)

                 range:  [0,1]                        units:  1
         unique values:  2                        missing .:  82/1,164

            tabulation:  Freq.  Value
                         1,053  0
                            29  1
                            82  .

---------------------------------------------------------------------------------------------------------------------------------------------------------------
mdh19b11                                                                                                                                   Age dx with melanoma
---------------------------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (double)

                 range:  [35,999]                     units:  1
         unique values:  22                       missing .:  266/1,164

                  mean:   969.902
              std. dev:   162.303

           percentiles:        10%       25%       50%       75%       90%
                               999       999       999       999       999

---------------------------------------------------------------------------------------------------------------------------------------------------------------
mdh19a12                                                                                                                                         Ovarian cancer
---------------------------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (double)

                 range:  [0,1]                        units:  1
         unique values:  2                        missing .:  82/1,164

            tabulation:  Freq.  Value
                         1,081  0
                             1  1
                            82  .

---------------------------------------------------------------------------------------------------------------------------------------------------------------
mdh19b12                                                                                                                             Age dx with ovarian cancer
---------------------------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (double)

                 range:  [1,999]                      units:  1
         unique values:  3                        missing .:  273/1,164

            tabulation:  Freq.  Value
                             1  1
                             1  34
                           889  999
                           273  .

---------------------------------------------------------------------------------------------------------------------------------------------------------------
mdh19a13                                                                                                                                      Pancreatic cancer
---------------------------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (double)

                 range:  [0,0]                        units:  1
         unique values:  1                        missing .:  82/1,164

            tabulation:  Freq.  Value
                         1,082  0
                            82  .

---------------------------------------------------------------------------------------------------------------------------------------------------------------
mdh19b13                                                                                                                          Age dx with pancreatic cancer
---------------------------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (double)

                 range:  [999,999]                    units:  1
         unique values:  1                        missing .:  273/1,164

            tabulation:  Freq.  Value
                           891  999
                           273  .

---------------------------------------------------------------------------------------------------------------------------------------------------------------
mdh19a14                                                                                                                                        Prostate cancer
---------------------------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (double)

                 range:  [0,1]                        units:  1
         unique values:  2                        missing .:  82/1,164

            tabulation:  Freq.  Value
                         1,004  0
                            78  1
                            82  .

---------------------------------------------------------------------------------------------------------------------------------------------------------------
mdh19b14                                                                                                                            Age dx with prostate cancer
---------------------------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (double)

                 range:  [23,999]                     units:  1
         unique values:  26                       missing .:  263/1,164

                  mean:   918.341
              std. dev:   262.165

           percentiles:        10%       25%       50%       75%       90%
                               999       999       999       999       999

---------------------------------------------------------------------------------------------------------------------------------------------------------------
mdh19a15                                                                                                                                    Skin cancer - basal
---------------------------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (double)

                 range:  [0,1]                        units:  1
         unique values:  2                        missing .:  82/1,164

            tabulation:  Freq.  Value
                           898  0
                           184  1
                            82  .

---------------------------------------------------------------------------------------------------------------------------------------------------------------
mdh19b15                                                                                                                        Age dx with skin cancer - basal
---------------------------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (double)

                 range:  [5,999]                      units:  1
         unique values:  52                       missing .:  254/1,164

                  mean:   809.136
              std. dev:   376.127

           percentiles:        10%       25%       50%       75%       90%
                                68       999       999       999       999

---------------------------------------------------------------------------------------------------------------------------------------------------------------
mdh19a16                                                                                                                                 Skin cancer - squamous
---------------------------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (double)

                 range:  [0,1]                        units:  1
         unique values:  2                        missing .:  82/1,164

            tabulation:  Freq.  Value
                         1,007  0
                            75  1
                            82  .

---------------------------------------------------------------------------------------------------------------------------------------------------------------
mdh19b16                                                                                                                     Age dx with skin cancer - squamous
---------------------------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (double)

                 range:  [40,999]                     units:  1
         unique values:  35                       missing .:  261/1,164

                  mean:   919.637
              std. dev:   260.101

           percentiles:        10%       25%       50%       75%       90%
                               999       999       999       999       999

---------------------------------------------------------------------------------------------------------------------------------------------------------------
mdh19a17                                                                                                                                         Stomach cancer
---------------------------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (double)

                 range:  [0,1]                        units:  1
         unique values:  2                        missing .:  82/1,164

            tabulation:  Freq.  Value
                         1,080  0
                             2  1
                            82  .

---------------------------------------------------------------------------------------------------------------------------------------------------------------
mdh19b17                                                                                                                             Age dx with stomach cancer
---------------------------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (double)

                 range:  [1,999]                      units:  1
         unique values:  3                        missing .:  274/1,164

            tabulation:  Freq.  Value
                             1  1
                             1  76
                           888  999
                           274  .

---------------------------------------------------------------------------------------------------------------------------------------------------------------
mdh19a18                                                                                                                                         Thyroid cancer
---------------------------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (double)

                 range:  [0,1]                        units:  1
         unique values:  2                        missing .:  82/1,164

            tabulation:  Freq.  Value
                         1,075  0
                             7  1
                            82  .

---------------------------------------------------------------------------------------------------------------------------------------------------------------
mdh19b18                                                                                                                             Age dx with thyroid cancer
---------------------------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (double)

                 range:  [4,999]                      units:  1
         unique values:  7                        missing .:  272/1,164

            tabulation:  Freq.  Value
                             1  4
                             1  51
                             3  57
                             1  66
                             1  72
                             1  76
                           884  999
                           272  .

---------------------------------------------------------------------------------------------------------------------------------------------------------------
mdh19a19                                                                                                                                           Other cancer
---------------------------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (double)

                 range:  [0,1]                        units:  1
         unique values:  2                        missing .:  82/1,164

            tabulation:  Freq.  Value
                         1,050  0
                            32  1
                            82  .

---------------------------------------------------------------------------------------------------------------------------------------------------------------
mdh19b19                                                                                                                               Age dx with other cancer
---------------------------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (double)

                 range:  [22,999]                     units:  1
         unique values:  20                       missing .:  272/1,164

                  mean:   966.361
              std. dev:   172.155

           percentiles:        10%       25%       50%       75%       90%
                               999       999       999       999       999

---------------------------------------------------------------------------------------------------------------------------------------------------------------
mdh19c19                                                                                                                                      Other cancer type
---------------------------------------------------------------------------------------------------------------------------------------------------------------

                  type:  string (str30)

         unique values:  46                       missing "":  1,061/1,164

              examples:  ""
                         ""
                         ""
                         ""

               warning:  variable has embedded blanks

---------------------------------------------------------------------------------------------------------------------------------------------------------------
mdhx20                                                                                                                               Doctor told osteoarthritis
---------------------------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (double)

                 range:  [0,8]                        units:  1
         unique values:  3                        missing .:  84/1,164

            tabulation:  Freq.  Value
                           448  0
                           624  1
                             8  8
                            84  .

---------------------------------------------------------------------------------------------------------------------------------------------------------------
mdhx20a1                                                                                                                                  Doctor dx OA of knees
---------------------------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (double)

                 range:  [0,8]                        units:  1
         unique values:  3                        missing .:  191/1,164

            tabulation:  Freq.  Value
                           635  0
                           331  1
                             7  8
                           191  .

---------------------------------------------------------------------------------------------------------------------------------------------------------------
mdhx20a2                                                                                                                                   Doctor dx OA of hips
---------------------------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (double)

                 range:  [0,8]                        units:  1
         unique values:  3                        missing .:  195/1,164

            tabulation:  Freq.  Value
                           817  0
                           140  1
                            12  8
                           195  .

---------------------------------------------------------------------------------------------------------------------------------------------------------------
mdhx20a3                                                                                                                                  Doctor dx OA of hands
---------------------------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (double)

                 range:  [0,8]                        units:  1
         unique values:  3                        missing .:  192/1,164

            tabulation:  Freq.  Value
                           612  0
                           352  1
                             8  8
                           192  .

---------------------------------------------------------------------------------------------------------------------------------------------------------------
mdhx20a4                                                                                                                                   Doctor dx OA of back
---------------------------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (double)

                 range:  [0,8]                        units:  1
         unique values:  3                        missing .:  193/1,164

            tabulation:  Freq.  Value
                           736  0
                           220  1
                            15  8
                           193  .

---------------------------------------------------------------------------------------------------------------------------------------------------------------
mdhx20a5                                                                                                                                   Doctor dx OA of neck
---------------------------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (double)

                 range:  [0,8]                        units:  1
         unique values:  3                        missing .:  194/1,164

            tabulation:  Freq.  Value
                           804  0
                           152  1
                            14  8
                           194  .

---------------------------------------------------------------------------------------------------------------------------------------------------------------
mdhx20a6                                                                                                                                   Doctor dx OA of feet
---------------------------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (double)

                 range:  [0,8]                        units:  1
         unique values:  3                        missing .:  195/1,164

            tabulation:  Freq.  Value
                           841  0
                           122  1
                             6  8
                           195  .

---------------------------------------------------------------------------------------------------------------------------------------------------------------
mdhx20a7                                                                                                                               Doctor dx OA of shoulder
---------------------------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (double)

                 range:  [0,8]                        units:  1
         unique values:  3                        missing .:  195/1,164

            tabulation:  Freq.  Value
                           809  0
                           149  1
                            11  8
                           195  .

---------------------------------------------------------------------------------------------------------------------------------------------------------------
mdhx21                                                                                                                                Doctor dx spinal stenosis
---------------------------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (double)

                 range:  [0,8]                        units:  1
         unique values:  3                        missing .:  89/1,164

            tabulation:  Freq.  Value
                           943  0
                           127  1
                             5  8
                            89  .

---------------------------------------------------------------------------------------------------------------------------------------------------------------
mdhx22                                                                                                                                   Ever told osteoporosis
---------------------------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (double)

                 range:  [0,8]                        units:  1
         unique values:  3                        missing .:  87/1,164

            tabulation:  Freq.  Value
                           835  0
                           234  1
                             8  8
                            87  .

---------------------------------------------------------------------------------------------------------------------------------------------------------------
mdhx23                                                                                                                           Doctor told had tissue disease
---------------------------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (double)

                 range:  [0,8]                        units:  1
         unique values:  3                        missing .:  89/1,164

            tabulation:  Freq.  Value
                           964  0
                           106  1
                             5  8
                            89  .

---------------------------------------------------------------------------------------------------------------------------------------------------------------
mdhx24                                                                                                                               Doctor told had Parkinsons
---------------------------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (double)

                 range:  [0,1]                        units:  1
         unique values:  2                        missing .:  89/1,164

            tabulation:  Freq.  Value
                         1,073  0
                             2  1
                            89  .

---------------------------------------------------------------------------------------------------------------------------------------------------------------
mdhx25                                                                                                                                          Doctor told PAD
---------------------------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (double)

                 range:  [0,8]                        units:  1
         unique values:  3                        missing .:  89/1,164

            tabulation:  Freq.  Value
                         1,053  0
                            15  1
                             7  8
                            89  .

---------------------------------------------------------------------------------------------------------------------------------------------------------------
mdhx26                                                                                                                                          Doctor told PVD
---------------------------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (double)

                 range:  [0,8]                        units:  1
         unique values:  3                        missing .:  87/1,164

            tabulation:  Freq.  Value
                           806  0
                           267  1
                             4  8
                            87  .

---------------------------------------------------------------------------------------------------------------------------------------------------------------
mdhx27a                                                                                                                                   Had cataract in 1 eye
---------------------------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (double)

                 range:  [0,8]                        units:  1
         unique values:  3                        missing .:  82/1,164

            tabulation:  Freq.  Value
                           444  0
                           632  1
                             6  8
                            82  .

---------------------------------------------------------------------------------------------------------------------------------------------------------------
mdhx27b                                                                                                                              Had cataracts in both eyes
---------------------------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (double)

                 range:  [0,8]                        units:  1
         unique values:  3                        missing .:  168/1,164

            tabulation:  Freq.  Value
                           391  0
                           587  1
                            18  8
                           168  .

---------------------------------------------------------------------------------------------------------------------------------------------------------------
mdhx27c                                                                                                                                           Told glaucoma
---------------------------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (double)

                 range:  [0,8]                        units:  1
         unique values:  3                        missing .:  82/1,164

            tabulation:  Freq.  Value
                           951  0
                           120  1
                            11  8
                            82  .

---------------------------------------------------------------------------------------------------------------------------------------------------------------
mdhx27d                                                                                                                                        Told retinopathy
---------------------------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (double)

                 range:  [0,8]                        units:  1
         unique values:  3                        missing .:  83/1,164

            tabulation:  Freq.  Value
                           897  0
                           173  1
                            11  8
                            83  .

---------------------------------------------------------------------------------------------------------------------------------------------------------------
mdhx27e                                                                                                                               Told macular degeneration
---------------------------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (double)

                 range:  [0,8]                        units:  1
         unique values:  3                        missing .:  82/1,164

            tabulation:  Freq.  Value
                           969  0
                            98  1
                            15  8
                            82  .

---------------------------------------------------------------------------------------------------------------------------------------------------------------
mdhx28                                                                                                                                        Doctor told ulcer
---------------------------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (double)

                 range:  [0,8]                        units:  1
         unique values:  3                        missing .:  89/1,164

            tabulation:  Freq.  Value
                         1,008  0
                            65  1
                             2  8
                            89  .

---------------------------------------------------------------------------------------------------------------------------------------------------------------
mdhx28a                                                                                                                                        Still have ulcer
---------------------------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (double)

                 range:  [0,1]                        units:  1
         unique values:  2                        missing .:  1,104/1,164

            tabulation:  Freq.  Value
                            59  0
                             1  1
                         1,104  .

---------------------------------------------------------------------------------------------------------------------------------------------------------------
mdhx29                                                                                                                                   Doctor told depression
---------------------------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (double)

                 range:  [0,8]                        units:  1
         unique values:  3                        missing .:  89/1,164

            tabulation:  Freq.  Value
                           912  0
                           157  1
                             6  8
                            89  .

---------------------------------------------------------------------------------------------------------------------------------------------------------------
mdhx29a                                                                                                                             Ever treated for depression
---------------------------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (double)

                 range:  [0,8]                        units:  1
         unique values:  3                        missing .:  1,011/1,164

            tabulation:  Freq.  Value
                            38  0
                           112  1
                             3  8
                         1,011  .

---------------------------------------------------------------------------------------------------------------------------------------------------------------
mmstot                                                                                                                                              (unlabeled)
---------------------------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (double)

                 range:  [19,30]                      units:  1
         unique values:  12                       missing .:  61/1,164

                  mean:   28.3808
              std. dev:   1.63838

           percentiles:        10%       25%       50%       75%       90%
                                26        28        29        30        30

---------------------------------------------------------------------------------------------------------------------------------------------------------------
mmstotp                                                                                                                                             (unlabeled)
---------------------------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (double)

                 range:  [19,30]                      units:  .01
         unique values:  15                       missing .:  61/1,164

                  mean:    28.385
              std. dev:   1.63681

           percentiles:        10%       25%       50%       75%       90%
                                26        28        29        30        30

---------------------------------------------------------------------------------------------------------------------------------------------------------------
dsstag                                                                                                                                              (unlabeled)
---------------------------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (double)

                 range:  [70,99]                      units:  1
         unique values:  10                       missing .:  27/1,164

                  mean:   71.5374
              std. dev:   5.75304

           percentiles:        10%       25%       50%       75%       90%
                                70        70        70        70        70

---------------------------------------------------------------------------------------------------------------------------------------------------------------
dsstot                                                                                                                                              (unlabeled)
---------------------------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (double)

                 range:  [9,87]                       units:  1
         unique values:  70                       missing .:  70/1,164

                  mean:   41.3309
              std. dev:   12.8404

           percentiles:        10%       25%       50%       75%       90%
                                26        32        40        50        59

---------------------------------------------------------------------------------------------------------------------------------------------------------------
age                                                                                                                                                 (unlabeled)
---------------------------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (double)

                 range:  [22.41478,100.82135]         units:  1.000e-06
         unique values:  1,114                    missing .:  10/1,164

                  mean:   74.1452
              std. dev:   12.7833

           percentiles:        10%       25%       50%       75%       90%
                           57.3881   67.6276   76.6338    83.603   87.6495

---------------------------------------------------------------------------------------------------------------------------------------------------------------
simtot                                                                                                                                      Similar Total score
---------------------------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (double)

                 range:  [0,27]                       units:  1
         unique values:  22                       missing .:  33/1,164

                  mean:   21.2149
              std. dev:   3.43341

           percentiles:        10%       25%       50%       75%       90%
                                17        20        22        24        25

---------------------------------------------------------------------------------------------------------------------------------------------------------------
wrttot                                                                                                                                               WRAT Total
---------------------------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (double)

                 range:  [22,57]                      units:  1
         unique values:  23                       missing .:  32/1,164

                  mean:   50.5954
              std. dev:   3.64138

           percentiles:        10%       25%       50%       75%       90%
                                46        49        51        53        55

---------------------------------------------------------------------------------------------------------------------------------------------------------------
boscor                                                                                                                           BostonNaming - # correct of 60
---------------------------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (double)

                 range:  [18,94]                      units:  1
         unique values:  37                       missing .:  176/1,164

                  mean:   53.9322
              std. dev:   6.26957

           percentiles:        10%       25%       50%       75%       90%
                                46        52        56        58        59

---------------------------------------------------------------------------------------------------------------------------------------------------------------
incg                                                                                                                                                (unlabeled)
---------------------------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (double)

                 range:  [1,1]                        units:  1
         unique values:  1                        missing .:  2/1,164

            tabulation:  Freq.  Value
                         1,162  1
                             2  .

---------------------------------------------------------------------------------------------------------------------------------------------------------------
inms                                                                                                                                                (unlabeled)
---------------------------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (double)

                 range:  [.,.]                        units:  .
         unique values:  0                        missing .:  1,164/1,164

            tabulation:  Freq.  Value
                         1,164  .

---------------------------------------------------------------------------------------------------------------------------------------------------------------
ms                                                                                                                                                  (unlabeled)
---------------------------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (double)

                 range:  [.,.]                        units:  .
         unique values:  0                        missing .:  1,164/1,164

            tabulation:  Freq.  Value
                         1,164  .

---------------------------------------------------------------------------------------------------------------------------------------------------------------
tr_exec                                                                                                                                             (unlabeled)
---------------------------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (double)

                 range:  [-13,272]                    units:  1
         unique values:  163                      missing .:  73/1,164

                  mean:   52.4858
              std. dev:   38.7944

           percentiles:        10%       25%       50%       75%       90%
                                20        28        42        64        98

---------------------------------------------------------------------------------------------------------------------------------------------------------------
trbts_log                                                                                                                                           (unlabeled)
---------------------------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (double)

                 range:  [1.3802112,2.4771213]        units:  1.000e-09
         unique values:  181                      missing .:  71/1,164

                  mean:    1.8873
              std. dev:   .196933

           percentiles:        10%       25%       50%       75%       90%
                           1.65321   1.74819   1.86923   2.00432   2.14613

---------------------------------------------------------------------------------------------------------------------------------------------------------------
tr_exec_log                                                                                                                                         (unlabeled)
---------------------------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (double)

                 range:  [0,2.4345689]                units:  1.000e-09
         unique values:  157                      missing .:  84/1,164

                  mean:   1.63681
              std. dev:   .274804

           percentiles:        10%       25%       50%       75%       90%
                           1.32222    1.4624   1.62325   1.80618   1.99564

---------------------------------------------------------------------------------------------------------------------------------------------------------------
sens_cog_tag                                                                                                                                        (unlabeled)
---------------------------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (double)

                 range:  [0,1]                        units:  1
         unique values:  2                        missing .:  2/1,164

            tabulation:  Freq.  Value
                         1,148  0
                            14  1
                             2  .

---------------------------------------------------------------------------------------------------------------------------------------------------------------
cestag                                                                                                                                              (unlabeled)
---------------------------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (double)

                 range:  [.,.]                        units:  .
         unique values:  0                        missing .:  1,164/1,164

            tabulation:  Freq.  Value
                         1,164  .

---------------------------------------------------------------------------------------------------------------------------------------------------------------
mmstag                                                                                                                                              (unlabeled)
---------------------------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (double)

                 range:  [.,.]                        units:  .
         unique values:  0                        missing .:  1,164/1,164

            tabulation:  Freq.  Value
                         1,164  .

---------------------------------------------------------------------------------------------------------------------------------------------------------------
home_visit                                                                                                               Flag to indicate visit was at home (Y)
---------------------------------------------------------------------------------------------------------------------------------------------------------------

                  type:  string (str2), but longest is str0

         unique values:  0                        missing "":  1,164/1,164

            tabulation:  Freq.  Value
                         1,164  ""

---------------------------------------------------------------------------------------------------------------------------------------------------------------
visacdate                                                                                                                               Visual Acuity Test Date
---------------------------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric daily date (long)

                 range:  [20100,21142]                units:  1
       or equivalently:  [12jan2015,19nov2017]        units:  days
         unique values:  491                      missing .:  100/1,164

                  mean:   20605.1 = 31may2016 (+ 2 hours)
              std. dev:   288.562

           percentiles:        10%       25%       50%       75%       90%
                             20207     20353   20606.5     20854     21005
                         29apr2015 22sep2015 01jun2016 04feb2017 05jul2017

---------------------------------------------------------------------------------------------------------------------------------------------------------------
logmar_pbe                                                                                                                            LOGMAR VA IN BE USING PVA
---------------------------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (double)

                 range:  [-.16,1.1]                   units:  .01
         unique values:  48                       missing .:  110/1,164

                  mean:    .19241
              std. dev:   .152642

           percentiles:        10%       25%       50%       75%       90%
                               .02        .1       .18        .3       .38

---------------------------------------------------------------------------------------------------------------------------------------------------------------
pva2040                                                                                                                               PREST VA worse than 20/40
---------------------------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (double)

                 range:  [0,1]                        units:  1
         unique values:  2                        missing .:  110/1,164

            tabulation:  Freq.  Value
                           787  0
                           267  1
                           110  .

---------------------------------------------------------------------------------------------------------------------------------------------------------------
logmar_pbe10                                                                                                                   LOGMAR PVA IN BE PER 01.0 CHANGE
---------------------------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (double)

                 range:  [-1.6,11]                    units:  .1
         unique values:  48                       missing .:  110/1,164

                  mean:    1.9241
              std. dev:   1.52642

           percentiles:        10%       25%       50%       75%       90%
                                .2         1       1.8         3       3.8

---------------------------------------------------------------------------------------------------------------------------------------------------------------
logmar_bcbe                                                                                                                                   LOGMAR VA IN BCBE
---------------------------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (double)

                 range:  [-.16,1]                     units:  1.000e-09
         unique values:  45                       missing .:  110/1,164

                  mean:   .095574
              std. dev:   .138948

           percentiles:        10%       25%       50%       75%       90%
                                 0         0         0        .2    .30103

---------------------------------------------------------------------------------------------------------------------------------------------------------------
logmar_bcbe10                                                                                                                 LOGMAR VA IN BCBE PER 0.10 CHANGE
---------------------------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (double)

                 range:  [-1.6,10]                    units:  1.000e-07
         unique values:  45                       missing .:  110/1,164

                  mean:   .955741
              std. dev:   1.38948

           percentiles:        10%       25%       50%       75%       90%
                                 0         0         0         2    3.0103

---------------------------------------------------------------------------------------------------------------------------------------------------------------
va2040                                                                                                                        VA worse than 20/40 USING BCBE VA
---------------------------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (double)

                 range:  [0,1]                        units:  1
         unique values:  2                        missing .:  110/1,164

            tabulation:  Freq.  Value
                           923  0
                           131  1
                           110  .

---------------------------------------------------------------------------------------------------------------------------------------------------------------
uncor_re                                                                                                                           UNCORRECTED REFRACTIVE ERROR
---------------------------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (double)

                 range:  [0,1]                        units:  1
         unique values:  2                        missing .:  110/1,164

            tabulation:  Freq.  Value
                           288  0
                           766  1
                           110  .

---------------------------------------------------------------------------------------------------------------------------------------------------------------
contrast                                                                                                                                                  LOGCS
---------------------------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (double)

                 range:  [.75,2.1]                    units:  .01
         unique values:  9                        missing .:  111/1,164

            tabulation:  Freq.  Value
                             1  .75
                             2  1.05
                             3  1.2
                             5  1.35
                            18  1.5
                            85  1.65
                           273  1.8
                           592  1.95
                            74  2.1
                           111  .

---------------------------------------------------------------------------------------------------------------------------------------------------------------
cs155                                                                                                                                         CS WORSE THAN 155
---------------------------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (double)

                 range:  [0,1]                        units:  1
         unique values:  2                        missing .:  111/1,164

            tabulation:  Freq.  Value
                         1,024  0
                            29  1
                           111  .

---------------------------------------------------------------------------------------------------------------------------------------------------------------
contrast10                                                                                                                                LOGCS PER 01.0 CHANGE
---------------------------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (double)

                 range:  [7.5,21]                     units:  .1
         unique values:  9                        missing .:  111/1,164

            tabulation:  Freq.  Value
                             1  7.5
                             2  10.5
                             3  12
                             5  13.5
                            18  15
                            85  16.5
                           273  18
                           592  19.5
                            74  21
                           111  .

---------------------------------------------------------------------------------------------------------------------------------------------------------------
sa_min                                                                                                                                          MINIMUM SA SEEN
---------------------------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (double)

                 range:  [40,800]                     units:  10
         unique values:  9                        missing .:  216/1,164

            tabulation:  Freq.  Value
                           621  40
                           118  50
                            65  60
                            28  80
                            31  100
                            20  140
                            25  200
                            20  400
                            20  800
                           216  .

---------------------------------------------------------------------------------------------------------------------------------------------------------------
sa80                                                                                                                            SA WORSE THAN (>) 80 SEC OF ARC
---------------------------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (double)

                 range:  [0,1]                        units:  1
         unique values:  2                        missing .:  216/1,164

            tabulation:  Freq.  Value
                           832  0
                           116  1
                           216  .

---------------------------------------------------------------------------------------------------------------------------------------------------------------
vision_visit                                                                                                                           VISIT W NEW VIS PROTOCOL
---------------------------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (double)

                 range:  [1,3]                        units:  1
         unique values:  3                        missing .:  97/1,164

            tabulation:  Freq.  Value
                           794  1
                           221  2
                            52  3
                            97  .

---------------------------------------------------------------------------------------------------------------------------------------------------------------
typevis                                                                                                                                             (unlabeled)
---------------------------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (double)

                 range:  [1,1]                        units:  1
         unique values:  1                        missing .:  97/1,164

            tabulation:  Freq.  Value
                         1,067  1
                            97  .

---------------------------------------------------------------------------------------------------------------------------------------------------------------
visit_date                                                                                                                                           visit_date
---------------------------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric daily date (long)

                 range:  [19807,21143]                units:  1
       or equivalently:  [25mar2014,20nov2017]        units:  days
         unique values:  437                      missing .:  257/1,164

                  mean:   20599.9 = 25may2016 (+ 22 hours)
              std. dev:   293.108

           percentiles:        10%       25%       50%       75%       90%
                             20201     20341     20606     20852     21006
                         23apr2015 10sep2015 01jun2016 02feb2017 06jul2017

---------------------------------------------------------------------------------------------------------------------------------------------------------------
missed                                                                                                                     TOTAL # POINTES MISSED IN ALL FIELDS
---------------------------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (double)

                 range:  [0,54]                       units:  1
         unique values:  26                       missing .:  257/1,164

                  mean:   2.12459
              std. dev:   3.86827

           percentiles:        10%       25%       50%       75%       90%
                                 0         0         1         3         5

---------------------------------------------------------------------------------------------------------------------------------------------------------------
cen                                                                                                          # POINTS MISSED IN CENTRAL 20 DEGREES OF VIS FIELD
---------------------------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (double)

                 range:  [0,31]                       units:  1
         unique values:  12                       missing .:  257/1,164

                  mean:   .495039
              std. dev:   1.55996

           percentiles:        10%       25%       50%       75%       90%
                                 0         0         0         0         2

---------------------------------------------------------------------------------------------------------------------------------------------------------------
perup                                                                                                             # POINTS MISSED IN UPPER PERIPHERAL VIS FIELD
---------------------------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (double)

                 range:  [0,13]                       units:  1
         unique values:  14                       missing .:  257/1,164

                  mean:     1.129
              std. dev:   2.02684

           percentiles:        10%       25%       50%       75%       90%
                                 0         0         0         2         3

---------------------------------------------------------------------------------------------------------------------------------------------------------------
perlo                                                                                                             # POINTS MISSED IN LOWER PERIPHERAL VIS FIELD
---------------------------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (double)

                 range:  [0,10]                       units:  1
         unique values:  11                       missing .:  257/1,164

                  mean:   .500551
              std. dev:   1.18803

           percentiles:        10%       25%       50%       75%       90%
                                 0         0         0         1         2

---------------------------------------------------------------------------------------------------------------------------------------------------------------
vf_impaired                                                                                                           MISSED >1SD OF POP MEAN (>6.5 PTS MISSED)
---------------------------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (double)

                 range:  [0,1]                        units:  1
         unique values:  2                        missing .:  257/1,164

            tabulation:  Freq.  Value
                           851  0
                            56  1
                           257  .

---------------------------------------------------------------------------------------------------------------------------------------------------------------
vf_visit                                                                                                                                            (unlabeled)
---------------------------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (double)

                 range:  [1,6]                        units:  1
         unique values:  6                        missing .:  257/1,164

            tabulation:  Freq.  Value
                           121  1
                           261  2
                           355  3
                           126  4
                            36  5
                             8  6
                           257  .

---------------------------------------------------------------------------------------------------------------------------------------------------------------
visvfdon                                                                                                                                         _VISVFDON_1436
---------------------------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (double)

                 range:  [0,1]                        units:  1
         unique values:  2                        missing .:  132/1,164

            tabulation:  Freq.  Value
                           143  0
                           889  1
                           132  .

---------------------------------------------------------------------------------------------------------------------------------------------------------------
visvfrnd                                                                                                                                          _VISVFRND_963
---------------------------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (double)

                 range:  [555,999]                    units:  1
         unique values:  5                        missing .:  1,024/1,164

            tabulation:  Freq.  Value
                            85  555
                             4  666
                             1  777
                            14  888
                            36  999
                         1,024  .

---------------------------------------------------------------------------------------------------------------------------------------------------------------
ina                                                                                                                                                 (unlabeled)
---------------------------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (double)

                 range:  [0,1]                        units:  1
         unique values:  2                        missing .:  81/1,164

            tabulation:  Freq.  Value
                            16  0
                         1,067  1
                            81  .

---------------------------------------------------------------------------------------------------------------------------------------------------------------
invf                                                                                                                                                (unlabeled)
---------------------------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (double)

                 range:  [1,1]                        units:  1
         unique values:  1                        missing .:  81/1,164

            tabulation:  Freq.  Value
                         1,083  1
                            81  .

---------------------------------------------------------------------------------------------------------------------------------------------------------------
bmi                                                                                                                                       ANTH: Body Mass Index
---------------------------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (double)

                 range:  [16.87,52.45]                units:  .01
         unique values:  783                      missing .:  83/1,164

                  mean:   27.0131
              std. dev:    4.6347

           percentiles:        10%       25%       50%       75%       90%
                             21.73     23.87      26.4     29.58     33.25

---------------------------------------------------------------------------------------------------------------------------------------------------------------
smokehx                                                                                                                                   SMOK: Smoking history
---------------------------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (double)

                 range:  [0,3]                        units:  1
         unique values:  4                        missing .:  113/1,164

            tabulation:  Freq.  Value
                           705  0
                           317  1
                            18  2
                            11  3
                           113  .

---------------------------------------------------------------------------------------------------------------------------------------------------------------
homevisit                                                                                                                                           (unlabeled)
---------------------------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (double)

                 range:  [0,0]                        units:  1
         unique values:  1                        missing .:  81/1,164

            tabulation:  Freq.  Value
                         1,083  0
                            81  .

---------------------------------------------------------------------------------------------------------------------------------------------------------------
cesd                                                                                                                                       CES Depression score
---------------------------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (double)

                 range:  [0,32]                       units:  1
         unique values:  30                       missing .:  93/1,164

                  mean:   5.27077
              std. dev:   5.06938

           percentiles:        10%       25%       50%       75%       90%
                                 0         2         4         7        12

---------------------------------------------------------------------------------------------------------------------------------------------------------------
cescut16                                                                                                                             CES Symptoms of depression
---------------------------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (double)

                 range:  [0,1]                        units:  1
         unique values:  2                        missing .:  93/1,164

            tabulation:  Freq.  Value
                         1,013  0
                            58  1
                            93  .

---------------------------------------------------------------------------------------------------------------------------------------------------------------
cescut20                                                                                                                 CES Significant symptoms of depression
---------------------------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (double)

                 range:  [0,1]                        units:  1
         unique values:  2                        missing .:  93/1,164

            tabulation:  Freq.  Value
                         1,046  0
                            25  1
                            93  .

---------------------------------------------------------------------------------------------------------------------------------------------------------------
sbp                                                                                                                     Composed Systolic blood pressure (mmHg)
---------------------------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (double)

                 range:  [70,192]                     units:  1
         unique values:  86                       missing .:  104/1,164

                  mean:   118.075
              std. dev:   15.6216

           percentiles:        10%       25%       50%       75%       90%
                               100       108       116     127.5       138

---------------------------------------------------------------------------------------------------------------------------------------------------------------
dbp                                                                                                                    Composed Diastolic blood pressure (mmHg)
---------------------------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (double)

                 range:  [45,94]                      units:  1
         unique values:  49                       missing .:  104/1,164

                  mean:   66.9925
              std. dev:   8.40702

           percentiles:        10%       25%       50%       75%       90%
                                57        60        67        72        78

---------------------------------------------------------------------------------------------------------------------------------------------------------------
oact01                                                                                                                                          Currently works
---------------------------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (double)

                 range:  [0,8]                        units:  1
         unique values:  3                        missing .:  96/1,164

            tabulation:  Freq.  Value
                           701  0
                           366  1
                             1  8
                            96  .

---------------------------------------------------------------------------------------------------------------------------------------------------------------
male                                                                                                                                                (unlabeled)
---------------------------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (double)

                 range:  [0,1]                        units:  1
         unique values:  2                        missing .:  81/1,164

            tabulation:  Freq.  Value
                           581  0
                           502  1
                            81  .

---------------------------------------------------------------------------------------------------------------------------------------------------------------
dod                                                                                                                                               Date of Death
---------------------------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric daily date (long)

                 range:  [20847,20894]                units:  1
       or equivalently:  [28jan2017,16mar2017]        units:  days
         unique values:  2                        missing .:  1,159/1,164

            tabulation:  Freq.  Value
                             2  20847  28jan2017
                             3  20894  16mar2017
                         1,159  .              .

---------------------------------------------------------------------------------------------------------------------------------------------------------------
racecd                                                                                                                                                     Race
---------------------------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (double)

                 range:  [0,9]                        units:  1
         unique values:  9                        missing .:  84/1,164

            tabulation:  Freq.  Value
                            31  0
                           733  1
                           278  2
                             2  3
                            12  4
                             3  5
                             8  7
                             9  8
                             4  9
                            84  .

---------------------------------------------------------------------------------------------------------------------------------------------------------------
educat                                                                                                                    Education category (highest attained)
---------------------------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (double)

                 range:  [0,4]                        units:  1
         unique values:  5                        missing .:  95/1,164

            tabulation:  Freq.  Value
                             7  0
                            51  1
                           112  2
                           236  3
                           663  4
                            95  .

---------------------------------------------------------------------------------------------------------------------------------------------------------------
black                                                                                                                                               (unlabeled)
---------------------------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (double)

                 range:  [0,1]                        units:  1
         unique values:  2                        missing .:  81/1,164

            tabulation:  Freq.  Value
                           797  0
                           286  1
                            81  .

---------------------------------------------------------------------------------------------------------------------------------------------------------------
indm                                                                                                                                                (unlabeled)
---------------------------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (double)

                 range:  [1,1]                        units:  1
         unique values:  1                        missing .:  81/1,164

            tabulation:  Freq.  Value
                         1,083  1
                            81  .

---------------------------------------------------------------------------------------------------------------------------------------------------------------
invs                                                                                                                                                (unlabeled)
---------------------------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (double)

                 range:  [1,1]                        units:  1
         unique values:  1                        missing .:  81/1,164

            tabulation:  Freq.  Value
                         1,083  1
                            81  .

---------------------------------------------------------------------------------------------------------------------------------------------------------------
_merge                                                                                                                                              (unlabeled)
---------------------------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (byte)
                 label:  _merge

                 range:  [1,3]                        units:  1
         unique values:  3                        missing .:  0/1,164

            tabulation:  Freq.   Numeric  Label
                            81         1  master only (1)
                             2         2  using only (2)
                         1,081         3  matched (3)

. do "C:\Users\sdu7\AppData\Local\Temp\STD3e04_000000.tmp"

. 
. local vis : varlist logmar_bcbe10 cont10_inv missed sa_min 
varlist not allowed
r(101);

end of do-file

r(101);

. do "C:\Users\sdu7\AppData\Local\Temp\STD3e04_000000.tmp"

. 
. local vis of varlist 

. 
end of do-file

. codebook `vis' ,com

Variable       Obs Unique      Mean       Min       Max  Label
---------------------------------------------------------------------------------------------------------------------------------------------------------------
idno          1164    827  4991.773       270      7996  BLSA ID NO
visit         1164     31  7.537801         1        31  Visit Number
dov           1164    457  20602.42     10974     21158  Date of Visit
cvlifr1tag    1138     12  71.56327        70        99  CVL Missing data tag for IFR1
cvlifr2tag    1138     12  71.58787        70        99  CVL Missing data tag for IFR2
cvlifr3tag    1138     11  71.61336        70        99  CVL Missing data tag for IFR3
cvlifr4tag    1138     11  71.60545        70        99  CVL Missing data tag for IFR4
cvlifr5tag    1138     11  71.60545        70        99  CVL Missing data tag for IFR5
cvlifrbtag    1138     11  71.63445        70        99  CVL Missing data tag for IFRB
cvlsdfrtag    1138     11  71.67135        70        99  CVL Missing data tag for SDFR
cvlsdcrtag    1138     11  71.65905        70        99  CVL Missing data tag for SDCR
cvlldfrtag    1138     11  71.73638        70        99  CVL Missing data tag for LDFR
cvlldcrtag    1138     11  71.74253        70        99  CVL Missing data tag for LDCR
cvlldretag    1138     12  71.67926         7        99  CVL Missing data tag for LDRE
cvltca        1107     65  50.38121         0        80  CVL Total correct A
cvlfrs        1105     17  9.894118         0        16  CVL #Corr A Short-Delay Free Recall
cvlfrl        1105     17  10.35475         0        16  CVL #Corr A Long-Delay Free Recall
flutag        1139     10  71.06234        70        99  Fluency tag
flucat        1130     71  15.48442       3.3        94  CategFluency - mean(fruit, animal, veg)
flulet        1131     77  14.68391         1        94  LettrFluency - mean(F, A, S)
fortag        1141     11  70.90885        70        99  WAIS-R Digits Forward Special data tag
bcktag        1140     11  71.05088        70        99  WAIS-R Digits Backward Special data tag
digfor        1107     14  8.062331         0        14  WAIS-R Digits Forward Traditional score
digbac        1101     15  7.015441         0        14  WAIS-R Digits Backward Traditional score
trailstag     1139     10  71.02107        70        99  NPTAG
trats         1126     80  34.43606        10       300  Trails - A test (seconds)
trbts         1093    181  86.17932        24       300  Trails - B test (seconds)
crdtag        1111     11  71.21692        70        99  Card Rotations: Special data tag
crdrot        1075    185  83.91535        -7       204  Card Rotations: Total score (correct-incorrect)
clktag         994     10  71.12072        70        99  Neuro Clk tag
clk325         984      9  8.505081         0        10  Clock 3:25
clk1110        984      8  8.953252         0        10  Clock 11:10
bvrtag        1110      9  70.70901        70        99  BVR Tag
bvrtot        1100     28  10.41545         0        27  BVR Total errors
oact06a       1072      6  1.467351         0         8  Freq do word puzzles past yr
oact06b       1071      6  .4397759         0         8  Freq do jigsaw puzzles past yr
oact06c       1072      7    3.6875         0         8  Freq read periodicals past yr
oact06d       1072      7  3.166045         0         8  Freq read books past yr
oact06e       1069      6  1.109448         0         8  Freq play board or card games past yr
oact06f       1071      6  3.648926         0         8  Freq use a computer past yr
oact06g       1071      7  .3034547         0         8  Freq play a musical instrument past yr
oact06i       1065      6  1.539906         0         8  Freq write anything past yr
oact06k       1070      6   .811215         0         8  Freq do crafts past yr
oact06l       1071      6  .5957049         0         8  Freq do artwork past yr
ca_sum        1072     31  16.15485         1        72  
ca_ratio      1072     40  1.797834  .1111111         8  
q1             163      5  1.503067         0         4  CFQ need to read again
q2             162      5  1.401235         0         4  CFQ forget why went from one part to other
q3             163      4  .9754601         0         3  CFQ note signpost on the road
q4             163      5   .601227         0         4  CFQ confuse right and left when given directions
q5             162      3  .3950617         0         2  CFQ bump into people
q6             163      5  1.147239         0         4  CFQ forget if turned life off/lock the door
q7             162      5   1.87037         0         4  CFQ listen to peoples names when meeting them
q8             162      4  .8703704         0         3  CFQ say something and realize it might be taking as insulting
q9             162      5  1.345679         0         4  CFQ fail to hear people speaking when doing something else
q10            162      4  .7037037         0         3  CFQ lose your temper and regreted
q11            163      4  .7300613         0         3  CFQ leave important letters unanswered for days
q12            163      4  .6687117         0         3  CFQ forget which way to turn in a road you know
q13            162      5  1.240741         0         4  CFQ fail to see what you want in the supermarket
q14            161      4  .9440994         0         3  CFQ wonder if you have used a word correctly
q15            160      5   1.15625         0         4  CFQ trouble making up your mind
q16            161      4   .689441         0         3  CFQ forget appointments
q17            162      5  1.537037         0         4  CFQ forget where you put something
q18            161      4  .4782609         0         3  CFQ accidentally throwing away the thing you want to keep
q19            162      4  1.197531         0         3  CFQ daydream when ought to be listenig to something
q20            159      5  2.232704         0         4  CFQ forget peoples names
q21            161      4  1.478261         0         3  CFQ start doing one thing and get distracted into doing something else
q22            160      5   1.99375         0         4  CFQ dont remember something that is on the tip of your tongue
q23            162      5  .9320988         0         4  CFQ forget what you went to the store to buy
q24            162      5  .9876543         0         4  CFQ drop things
q25            161      5  .9875776         0         4  CFQ cant think of anything to say
dxatvi        1081      4  .0263645       -.5         1  
smk01         1074      2  .4115456         0         1  Ever smoked 100 cigarettes
smk01a         434      2  .8709677         0         1  Ever smoked regularly
smk01b         378     21  18.63757        11        35  Age began smoking
smk01c         376     22   14.7633         1        60  Average cigarettes per day
smk01d         363      3  .0716253         0         8  Smokes cigarettes now
smk01e          10      8       6.1         1        20  Cigarettes currrently smoked per day
smk01f          10      5       2.2         0        10  Times tried to quit smoking
smk01g         362     50  37.14917        16        82  Age quit smoking
smk02         1072      3  .0802239         0         8  Ever smoked 50 cigars
smk02a          78     22  27.26923        14        51  Age began smoking cigars
smk02b          76     13  5.342105         1        50  Cigars smoked per week
smk02c          73      2  .1232877         0         1  Smokes cigars now
smk02d           9      4  4.111111         1        14  Cigars smoked now per week
smk02e          68     28        40        19        74  Age quit smoking cigars
smk03         1075      3  .1339535         0         8  Ever smoke 3 packages pipe tobacco
smk03a         123     18  23.84553        16        51  Age began pipe smoking
smk03b         121     20  10.17355         1        70  Pipefuls smoked per week
smk03c         112      2  .0267857         0         1  Smokes pipe now
smk03d           3      2        14         0        21  Pipefuls smoked now per week
smk03e         113     31  34.74336        17        68  Age quit pipe smoking
mdhx1         1073      3  .9561976         0         8  Seen doctor since last visit
mdhx2         1075      5  1.619535         1         5  Medical check up frequency
mdhx3         1074      3  .0595903         0         8  Doctor told heart attack
mdhx3a          38      5  3.342105         1         8  How long ago most recent MI
mdhx4         1075      3  .0344186         0         8  Doctor told CHF
mdhx5         1075      2       .04         0         1  Doctor told angina
mdhx6         1075      3  .0530233         0         8  Doctor told bronchitis
mdhx7         1075      3  .1144186         0         8  Doctor told asthma
mdhx7a          87      3  .8390805         0         8  Still have asthma
mdhx8         1075      3  .0130233         0         8  Doctor told cirrhosis
mdhx9         1075      3  .0567442         0         8  Doctor told hepatitis
mdhx10        1075      1         0         0         0  Doctor told HIV or AIDS
mdhx11        1076      3  .0501859         0         8  Doctor told kidney disease
mdhx12        1077      3  .0696379         0         8  Doctor told stroke
mdhx12a         40      5         3         1         8  How long ago most recent stroke
mdhx13        1078      3  .0955473         0         8  Doctor told TIA
mdhx13a         47      5         3         1         8  How long ago most recent TIA
mdhx14        1075      3  .2186047         0         8  Doctor told peripheral neuropathy
mdhx15        1081      3  .5134135         0         8  Ever told hypertensive
mdhx15a        518      2  .8667954         0         1  Taking medication for hypertension
mdhx15b        102      3  .5882353         0         8  Still have hypertension
mdhx15c        517      2  .8762089         0         1  Lifestyle change for hypertension
mdhx16        1079      3  .1927711         0         8  Doctor told diabetes
mdhx16a        174      3  .4597701         0         8  Taking medication for diabetes
mdhx16b         91      3  1.637363         0         8  Still have diabetes
mdhx16c        169      3  .9704142         0         8  Lifestyle change for diabetes
mdhx17        1080      3  .6574074         0         8  High blood cholesterol
mdhx17b        287      3  2.191638         0         8  Still have high cholesterol
mdhx17c        623      3  .9020867         0         8  Lifestyle change for lipid levels
mdhx18        1074      2  .0670391         0         1  Ever had any vascular procedures
mdhx18a1       901      2   .036626         0         1  Had CABG
mdhx18a2       894      2  .0380313         0         1  Had angioplasty
mdhx18a3       892      2  .0089686         0         1  Had leg bypass surgery
mdhx18a4       892      2  .0134529         0         1  Had leg angioplasty
mdhx18a5       892      2  .0089686         0         1  Had carotid endaterectomy
mdhx18a6       892      2  .0033632         0         1  Had aneurysm repair
mdhx19        1075      3  .3590698         0         8  Doctor told cancer
mdh19a1       1082      2  .0046211         0         1  Bladder cancer
mdh19b1        892      5   993.787        59       999  Age dx with bladder cancer
mdh19a2       1082      2  .0018484         0         1  Brain cancer
mdh19b2        890      4  995.7944        11       999  Age dx with brain cancer
mdh19a3       1082      2  .0341959         0         1  Breast cancer
mdh19b3        896     23  960.2701        12       999  Age dx with breast cancer
mdh19a4       1082      2  .0036969         0         1  Cervical cancer
mdh19b4        890      4  994.6798        21       999  Age dx with cervical cancer
mdh19a5       1082      2  .0083179         0         1  Colon cancer
mdh19b5        892     10  989.5045        38       999  Age dx with colon cancer
mdh19a6       1082      2  .0046211         0         1  Endometrial cancer
mdh19b6        891      6  993.7183        54       999  Age dx with endometrial cancer
mdh19a7       1082      2  .0027726         0         1  Leukemia
mdh19b7        891      3  995.9113        79       999  Age dx with leukemia
mdh19a8       1082      1         0         0         0  Liver cancer
mdh19b8        891      1       999       999       999  Age dx with liver cancer
mdh19a9       1082      2  .0027726         0         1  Lung cancer
mdh19b9        892      4    995.88        57       999  Age dx with lung cancer
mdh19a10      1082      2  .0101664         0         1  Lymphoma
mdh19b10       894      8  987.6174        63       999  Age dx with lymphoma
mdh19a11      1082      2  .0268022         0         1  Melanoma
mdh19b11       898     22   969.902        35       999  Age dx with melanoma
mdh19a12      1082      2  .0009242         0         1  Ovarian cancer
mdh19b12       891      3  996.7969         1       999  Age dx with ovarian cancer
mdh19a13      1082      1         0         0         0  Pancreatic cancer
mdh19b13       891      1       999       999       999  Age dx with pancreatic cancer
mdh19a14      1082      2  .0720887         0         1  Prostate cancer
mdh19b14       901     26  918.3407        23       999  Age dx with prostate cancer
mdh19a15      1082      2  .1700555         0         1  Skin cancer - basal
mdh19b15       910     52  809.1363         5       999  Age dx with skin cancer - basal
mdh19a16      1082      2  .0693161         0         1  Skin cancer - squamous
mdh19b16       903     35  919.6368        40       999  Age dx with skin cancer - squamous
mdh19a17      1082      2  .0018484         0         1  Stomach cancer
mdh19b17       890      3  996.8416         1       999  Age dx with stomach cancer
mdh19a18      1082      2  .0064695         0         1  Thyroid cancer
mdh19b18       892      7  990.5336         4       999  Age dx with thyroid cancer
mdh19a19      1082      2  .0295749         0         1  Other cancer
mdh19b19       892     20   966.361        22       999  Age dx with other cancer
mdh19c19       103     46         .         .         .  Other cancer type
mdhx20        1080      3   .637037         0         8  Doctor told osteoarthritis
mdhx20a1       973      3   .397739         0         8  Doctor dx OA of knees
mdhx20a2       969      3  .2435501         0         8  Doctor dx OA of hips
mdhx20a3       972      3  .4279835         0         8  Doctor dx OA of hands
mdhx20a4       971      3  .3501545         0         8  Doctor dx OA of back
mdhx20a5       970      3  .2721649         0         8  Doctor dx OA of neck
mdhx20a6       969      3  .1754386         0         8  Doctor dx OA of feet
mdhx20a7       969      3   .244582         0         8  Doctor dx OA of shoulder
mdhx21        1075      3  .1553488         0         8  Doctor dx spinal stenosis
mdhx22        1077      3  .2766945         0         8  Ever told osteoporosis
mdhx23        1075      3   .135814         0         8  Doctor told had tissue disease
mdhx24        1075      2  .0018605         0         1  Doctor told had Parkinsons
mdhx25        1075      3  .0660465         0         8  Doctor told PAD
mdhx26        1077      3   .277623         0         8  Doctor told PVD
mdhx27a       1082      3  .6284658         0         8  Had cataract in 1 eye
mdhx27b        996      3  .7339357         0         8  Had cataracts in both eyes
mdhx27c       1082      3  .1922366         0         8  Told glaucoma
mdhx27d       1081      3  .2414431         0         8  Told retinopathy
mdhx27e       1082      3  .2014787         0         8  Told macular degeneration
mdhx28        1075      3  .0753488         0         8  Doctor told ulcer
mdhx28a         60      2  .0166667         0         1  Still have ulcer
mdhx29        1075      3  .1906977         0         8  Doctor told depression
mdhx29a        153      3  .8888889         0         8  Ever treated for depression
mmstot        1103     12  28.38078        19        30  
mmstotp       1103     15  28.38504        19        30  
dsstag        1137     10  71.53738        70        99  
dsstot        1094     70   41.3309         9        87  
age           1154   1114  74.14515  22.41478  100.8214  
simtot        1131     22  21.21485         0        27  Similar Total score
wrttot        1132     23  50.59541        22        57  WRAT Total
boscor         988     37  53.93219        18        94  BostonNaming - # correct of 60
incg          1162      1         1         1         1  
inms             0      0         .         .         .  
ms               0      0         .         .         .  
tr_exec       1091    163  52.48579       -13       272  
trbts_log     1093    181  1.887298  1.380211  2.477121  
tr_exec_log   1080    157  1.636815         0  2.434569  
sens_cog_tag  1162      2  .0120482         0         1  
cestag           0      0         .         .         .  
mmstag           0      0         .         .         .  
home_visit       0      0         .         .         .  Flag to indicate visit was at home (Y)
visacdate     1064    491  20605.07     20100     21142  Visual Acuity Test Date
logmar_pbe    1054     48  .1924099      -.16       1.1  LOGMAR VA IN BE USING PVA
pva2040       1054      2  .2533207         0         1  PREST VA worse than 20/40
logmar_pbe10  1054     48  1.924099      -1.6        11  LOGMAR PVA IN BE PER 01.0 CHANGE
logmar_bcbe   1054     45  .0955741      -.16         1  LOGMAR VA IN BCBE
logmar_bc~10  1054     45  .9557407      -1.6        10  LOGMAR VA IN BCBE PER 0.10 CHANGE
va2040        1054      2  .1242884         0         1  VA worse than 20/40 USING BCBE VA
uncor_re      1054      2  .7267552         0         1  UNCORRECTED REFRACTIVE ERROR
contrast      1053      9  1.881909       .75       2.1  LOGCS
cs155         1053      2  .0275404         0         1  CS WORSE THAN 155
contrast10    1053      9  18.81909       7.5        21  LOGCS PER 01.0 CHANGE
sa_min         948      9   75.7173        40       800  MINIMUM SA SEEN
sa80           948      2  .1223629         0         1  SA WORSE THAN (>) 80 SEC OF ARC
vision_visit  1067      3  1.304592         1         3  VISIT W NEW VIS PROTOCOL
typevis       1067      1         1         1         1  
visit_date     907    437   20599.9     19807     21143  visit_date
missed         907     26  2.124587         0        54  TOTAL # POINTES MISSED IN ALL FIELDS
cen            907     12  .4950386         0        31  # POINTS MISSED IN CENTRAL 20 DEGREES OF VIS FIELD
perup          907     14  1.128997         0        13  # POINTS MISSED IN UPPER PERIPHERAL VIS FIELD
perlo          907     11  .5005513         0        10  # POINTS MISSED IN LOWER PERIPHERAL VIS FIELD
vf_impaired    907      2   .061742         0         1  MISSED >1SD OF POP MEAN (>6.5 PTS MISSED)
vf_visit       907      6  2.690187         1         6  
visvfdon      1032      2  .8614341         0         1  _VISVFDON_1436
visvfrnd       140      5  707.2286       555       999  _VISVFRND_963
ina           1083      2  .9852262         0         1  
invf          1083      1         1         1         1  
bmi           1081    783   27.0131     16.87     52.45  ANTH: Body Mass Index
smokehx       1051      4  .3672693         0         3  SMOK: Smoking history
homevisit     1083      1         0         0         0  
cesd          1071     30  5.270775         0        32  CES Depression score
cescut16      1071      2   .054155         0         1  CES Symptoms of depression
cescut20      1071      2  .0233427         0         1  CES Significant symptoms of depression
sbp           1060     86  118.0755        70       192  Composed Systolic blood pressure (mmHg)
dbp           1060     49  66.99245        45        94  Composed Diastolic blood pressure (mmHg)
oact01        1068      3  .3501873         0         8  Currently works
male          1083      2  .4635272         0         1  
dod              5      2   20875.2     20847     20894  Date of Death
racecd        1080      9  1.409259         0         9  Race
educat        1069      5  3.400374         0         4  Education category (highest attained)
black         1083      2  .2640813         0         1  
indm          1083      1         1         1         1  
invs          1083      1         1         1         1  
_merge        1164      3  2.859107         1         3  
---------------------------------------------------------------------------------------------------------------------------------------------------------------

. do "C:\Users\sdu7\AppData\Local\Temp\STD3e04_000000.tmp"

. local vis of var logmar_bcbe10 cont10_inv missed sa_min  

. 
end of do-file

. codebook `var',com

Variable       Obs Unique      Mean       Min       Max  Label
---------------------------------------------------------------------------------------------------------------------------------------------------------------
idno          1164    827  4991.773       270      7996  BLSA ID NO
visit         1164     31  7.537801         1        31  Visit Number
dov           1164    457  20602.42     10974     21158  Date of Visit
cvlifr1tag    1138     12  71.56327        70        99  CVL Missing data tag for IFR1
cvlifr2tag    1138     12  71.58787        70        99  CVL Missing data tag for IFR2
cvlifr3tag    1138     11  71.61336        70        99  CVL Missing data tag for IFR3
cvlifr4tag    1138     11  71.60545        70        99  CVL Missing data tag for IFR4
cvlifr5tag    1138     11  71.60545        70        99  CVL Missing data tag for IFR5
cvlifrbtag    1138     11  71.63445        70        99  CVL Missing data tag for IFRB
cvlsdfrtag    1138     11  71.67135        70        99  CVL Missing data tag for SDFR
cvlsdcrtag    1138     11  71.65905        70        99  CVL Missing data tag for SDCR
cvlldfrtag    1138     11  71.73638        70        99  CVL Missing data tag for LDFR
cvlldcrtag    1138     11  71.74253        70        99  CVL Missing data tag for LDCR
cvlldretag    1138     12  71.67926         7        99  CVL Missing data tag for LDRE
cvltca        1107     65  50.38121         0        80  CVL Total correct A
cvlfrs        1105     17  9.894118         0        16  CVL #Corr A Short-Delay Free Recall
cvlfrl        1105     17  10.35475         0        16  CVL #Corr A Long-Delay Free Recall
flutag        1139     10  71.06234        70        99  Fluency tag
flucat        1130     71  15.48442       3.3        94  CategFluency - mean(fruit, animal, veg)
flulet        1131     77  14.68391         1        94  LettrFluency - mean(F, A, S)
fortag        1141     11  70.90885        70        99  WAIS-R Digits Forward Special data tag
bcktag        1140     11  71.05088        70        99  WAIS-R Digits Backward Special data tag
digfor        1107     14  8.062331         0        14  WAIS-R Digits Forward Traditional score
digbac        1101     15  7.015441         0        14  WAIS-R Digits Backward Traditional score
trailstag     1139     10  71.02107        70        99  NPTAG
trats         1126     80  34.43606        10       300  Trails - A test (seconds)
trbts         1093    181  86.17932        24       300  Trails - B test (seconds)
crdtag        1111     11  71.21692        70        99  Card Rotations: Special data tag
crdrot        1075    185  83.91535        -7       204  Card Rotations: Total score (correct-incorrect)
clktag         994     10  71.12072        70        99  Neuro Clk tag
clk325         984      9  8.505081         0        10  Clock 3:25
clk1110        984      8  8.953252         0        10  Clock 11:10
bvrtag        1110      9  70.70901        70        99  BVR Tag
bvrtot        1100     28  10.41545         0        27  BVR Total errors
oact06a       1072      6  1.467351         0         8  Freq do word puzzles past yr
oact06b       1071      6  .4397759         0         8  Freq do jigsaw puzzles past yr
oact06c       1072      7    3.6875         0         8  Freq read periodicals past yr
oact06d       1072      7  3.166045         0         8  Freq read books past yr
oact06e       1069      6  1.109448         0         8  Freq play board or card games past yr
oact06f       1071      6  3.648926         0         8  Freq use a computer past yr
oact06g       1071      7  .3034547         0         8  Freq play a musical instrument past yr
oact06i       1065      6  1.539906         0         8  Freq write anything past yr
oact06k       1070      6   .811215         0         8  Freq do crafts past yr
oact06l       1071      6  .5957049         0         8  Freq do artwork past yr
ca_sum        1072     31  16.15485         1        72  
ca_ratio      1072     40  1.797834  .1111111         8  
q1             163      5  1.503067         0         4  CFQ need to read again
q2             162      5  1.401235         0         4  CFQ forget why went from one part to other
q3             163      4  .9754601         0         3  CFQ note signpost on the road
q4             163      5   .601227         0         4  CFQ confuse right and left when given directions
q5             162      3  .3950617         0         2  CFQ bump into people
q6             163      5  1.147239         0         4  CFQ forget if turned life off/lock the door
q7             162      5   1.87037         0         4  CFQ listen to peoples names when meeting them
q8             162      4  .8703704         0         3  CFQ say something and realize it might be taking as insulting
q9             162      5  1.345679         0         4  CFQ fail to hear people speaking when doing something else
q10            162      4  .7037037         0         3  CFQ lose your temper and regreted
q11            163      4  .7300613         0         3  CFQ leave important letters unanswered for days
q12            163      4  .6687117         0         3  CFQ forget which way to turn in a road you know
q13            162      5  1.240741         0         4  CFQ fail to see what you want in the supermarket
q14            161      4  .9440994         0         3  CFQ wonder if you have used a word correctly
q15            160      5   1.15625         0         4  CFQ trouble making up your mind
q16            161      4   .689441         0         3  CFQ forget appointments
q17            162      5  1.537037         0         4  CFQ forget where you put something
q18            161      4  .4782609         0         3  CFQ accidentally throwing away the thing you want to keep
q19            162      4  1.197531         0         3  CFQ daydream when ought to be listenig to something
q20            159      5  2.232704         0         4  CFQ forget peoples names
q21            161      4  1.478261         0         3  CFQ start doing one thing and get distracted into doing something else
q22            160      5   1.99375         0         4  CFQ dont remember something that is on the tip of your tongue
q23            162      5  .9320988         0         4  CFQ forget what you went to the store to buy
q24            162      5  .9876543         0         4  CFQ drop things
q25            161      5  .9875776         0         4  CFQ cant think of anything to say
dxatvi        1081      4  .0263645       -.5         1  
smk01         1074      2  .4115456         0         1  Ever smoked 100 cigarettes
smk01a         434      2  .8709677         0         1  Ever smoked regularly
smk01b         378     21  18.63757        11        35  Age began smoking
smk01c         376     22   14.7633         1        60  Average cigarettes per day
smk01d         363      3  .0716253         0         8  Smokes cigarettes now
smk01e          10      8       6.1         1        20  Cigarettes currrently smoked per day
smk01f          10      5       2.2         0        10  Times tried to quit smoking
smk01g         362     50  37.14917        16        82  Age quit smoking
smk02         1072      3  .0802239         0         8  Ever smoked 50 cigars
smk02a          78     22  27.26923        14        51  Age began smoking cigars
smk02b          76     13  5.342105         1        50  Cigars smoked per week
smk02c          73      2  .1232877         0         1  Smokes cigars now
smk02d           9      4  4.111111         1        14  Cigars smoked now per week
smk02e          68     28        40        19        74  Age quit smoking cigars
smk03         1075      3  .1339535         0         8  Ever smoke 3 packages pipe tobacco
smk03a         123     18  23.84553        16        51  Age began pipe smoking
smk03b         121     20  10.17355         1        70  Pipefuls smoked per week
smk03c         112      2  .0267857         0         1  Smokes pipe now
smk03d           3      2        14         0        21  Pipefuls smoked now per week
smk03e         113     31  34.74336        17        68  Age quit pipe smoking
mdhx1         1073      3  .9561976         0         8  Seen doctor since last visit
mdhx2         1075      5  1.619535         1         5  Medical check up frequency
mdhx3         1074      3  .0595903         0         8  Doctor told heart attack
mdhx3a          38      5  3.342105         1         8  How long ago most recent MI
mdhx4         1075      3  .0344186         0         8  Doctor told CHF
mdhx5         1075      2       .04         0         1  Doctor told angina
mdhx6         1075      3  .0530233         0         8  Doctor told bronchitis
mdhx7         1075      3  .1144186         0         8  Doctor told asthma
mdhx7a          87      3  .8390805         0         8  Still have asthma
mdhx8         1075      3  .0130233         0         8  Doctor told cirrhosis
mdhx9         1075      3  .0567442         0         8  Doctor told hepatitis
mdhx10        1075      1         0         0         0  Doctor told HIV or AIDS
mdhx11        1076      3  .0501859         0         8  Doctor told kidney disease
mdhx12        1077      3  .0696379         0         8  Doctor told stroke
mdhx12a         40      5         3         1         8  How long ago most recent stroke
mdhx13        1078      3  .0955473         0         8  Doctor told TIA
mdhx13a         47      5         3         1         8  How long ago most recent TIA
mdhx14        1075      3  .2186047         0         8  Doctor told peripheral neuropathy
mdhx15        1081      3  .5134135         0         8  Ever told hypertensive
mdhx15a        518      2  .8667954         0         1  Taking medication for hypertension
mdhx15b        102      3  .5882353         0         8  Still have hypertension
mdhx15c        517      2  .8762089         0         1  Lifestyle change for hypertension
mdhx16        1079      3  .1927711         0         8  Doctor told diabetes
mdhx16a        174      3  .4597701         0         8  Taking medication for diabetes
mdhx16b         91      3  1.637363         0         8  Still have diabetes
mdhx16c        169      3  .9704142         0         8  Lifestyle change for diabetes
mdhx17        1080      3  .6574074         0         8  High blood cholesterol
mdhx17b        287      3  2.191638         0         8  Still have high cholesterol
mdhx17c        623      3  .9020867         0         8  Lifestyle change for lipid levels
mdhx18        1074      2  .0670391         0         1  Ever had any vascular procedures
mdhx18a1       901      2   .036626         0         1  Had CABG
mdhx18a2       894      2  .0380313         0         1  Had angioplasty
mdhx18a3       892      2  .0089686         0         1  Had leg bypass surgery
mdhx18a4       892      2  .0134529         0         1  Had leg angioplasty
mdhx18a5       892      2  .0089686         0         1  Had carotid endaterectomy
mdhx18a6       892      2  .0033632         0         1  Had aneurysm repair
mdhx19        1075      3  .3590698         0         8  Doctor told cancer
mdh19a1       1082      2  .0046211         0         1  Bladder cancer
mdh19b1        892      5   993.787        59       999  Age dx with bladder cancer
mdh19a2       1082      2  .0018484         0         1  Brain cancer
mdh19b2        890      4  995.7944        11       999  Age dx with brain cancer
mdh19a3       1082      2  .0341959         0         1  Breast cancer
mdh19b3        896     23  960.2701        12       999  Age dx with breast cancer
mdh19a4       1082      2  .0036969         0         1  Cervical cancer
mdh19b4        890      4  994.6798        21       999  Age dx with cervical cancer
mdh19a5       1082      2  .0083179         0         1  Colon cancer
mdh19b5        892     10  989.5045        38       999  Age dx with colon cancer
mdh19a6       1082      2  .0046211         0         1  Endometrial cancer
mdh19b6        891      6  993.7183        54       999  Age dx with endometrial cancer
mdh19a7       1082      2  .0027726         0         1  Leukemia
mdh19b7        891      3  995.9113        79       999  Age dx with leukemia
mdh19a8       1082      1         0         0         0  Liver cancer
mdh19b8        891      1       999       999       999  Age dx with liver cancer
mdh19a9       1082      2  .0027726         0         1  Lung cancer
mdh19b9        892      4    995.88        57       999  Age dx with lung cancer
mdh19a10      1082      2  .0101664         0         1  Lymphoma
mdh19b10       894      8  987.6174        63       999  Age dx with lymphoma
mdh19a11      1082      2  .0268022         0         1  Melanoma
mdh19b11       898     22   969.902        35       999  Age dx with melanoma
mdh19a12      1082      2  .0009242         0         1  Ovarian cancer
mdh19b12       891      3  996.7969         1       999  Age dx with ovarian cancer
mdh19a13      1082      1         0         0         0  Pancreatic cancer
mdh19b13       891      1       999       999       999  Age dx with pancreatic cancer
mdh19a14      1082      2  .0720887         0         1  Prostate cancer
mdh19b14       901     26  918.3407        23       999  Age dx with prostate cancer
mdh19a15      1082      2  .1700555         0         1  Skin cancer - basal
mdh19b15       910     52  809.1363         5       999  Age dx with skin cancer - basal
mdh19a16      1082      2  .0693161         0         1  Skin cancer - squamous
mdh19b16       903     35  919.6368        40       999  Age dx with skin cancer - squamous
mdh19a17      1082      2  .0018484         0         1  Stomach cancer
mdh19b17       890      3  996.8416         1       999  Age dx with stomach cancer
mdh19a18      1082      2  .0064695         0         1  Thyroid cancer
mdh19b18       892      7  990.5336         4       999  Age dx with thyroid cancer
mdh19a19      1082      2  .0295749         0         1  Other cancer
mdh19b19       892     20   966.361        22       999  Age dx with other cancer
mdh19c19       103     46         .         .         .  Other cancer type
mdhx20        1080      3   .637037         0         8  Doctor told osteoarthritis
mdhx20a1       973      3   .397739         0         8  Doctor dx OA of knees
mdhx20a2       969      3  .2435501         0         8  Doctor dx OA of hips
mdhx20a3       972      3  .4279835         0         8  Doctor dx OA of hands
mdhx20a4       971      3  .3501545         0         8  Doctor dx OA of back
mdhx20a5       970      3  .2721649         0         8  Doctor dx OA of neck
mdhx20a6       969      3  .1754386         0         8  Doctor dx OA of feet
mdhx20a7       969      3   .244582         0         8  Doctor dx OA of shoulder
mdhx21        1075      3  .1553488         0         8  Doctor dx spinal stenosis
mdhx22        1077      3  .2766945         0         8  Ever told osteoporosis
mdhx23        1075      3   .135814         0         8  Doctor told had tissue disease
mdhx24        1075      2  .0018605         0         1  Doctor told had Parkinsons
mdhx25        1075      3  .0660465         0         8  Doctor told PAD
mdhx26        1077      3   .277623         0         8  Doctor told PVD
mdhx27a       1082      3  .6284658         0         8  Had cataract in 1 eye
mdhx27b        996      3  .7339357         0         8  Had cataracts in both eyes
mdhx27c       1082      3  .1922366         0         8  Told glaucoma
mdhx27d       1081      3  .2414431         0         8  Told retinopathy
mdhx27e       1082      3  .2014787         0         8  Told macular degeneration
mdhx28        1075      3  .0753488         0         8  Doctor told ulcer
mdhx28a         60      2  .0166667         0         1  Still have ulcer
mdhx29        1075      3  .1906977         0         8  Doctor told depression
mdhx29a        153      3  .8888889         0         8  Ever treated for depression
mmstot        1103     12  28.38078        19        30  
mmstotp       1103     15  28.38504        19        30  
dsstag        1137     10  71.53738        70        99  
dsstot        1094     70   41.3309         9        87  
age           1154   1114  74.14515  22.41478  100.8214  
simtot        1131     22  21.21485         0        27  Similar Total score
wrttot        1132     23  50.59541        22        57  WRAT Total
boscor         988     37  53.93219        18        94  BostonNaming - # correct of 60
incg          1162      1         1         1         1  
inms             0      0         .         .         .  
ms               0      0         .         .         .  
tr_exec       1091    163  52.48579       -13       272  
trbts_log     1093    181  1.887298  1.380211  2.477121  
tr_exec_log   1080    157  1.636815         0  2.434569  
sens_cog_tag  1162      2  .0120482         0         1  
cestag           0      0         .         .         .  
mmstag           0      0         .         .         .  
home_visit       0      0         .         .         .  Flag to indicate visit was at home (Y)
visacdate     1064    491  20605.07     20100     21142  Visual Acuity Test Date
logmar_pbe    1054     48  .1924099      -.16       1.1  LOGMAR VA IN BE USING PVA
pva2040       1054      2  .2533207         0         1  PREST VA worse than 20/40
logmar_pbe10  1054     48  1.924099      -1.6        11  LOGMAR PVA IN BE PER 01.0 CHANGE
logmar_bcbe   1054     45  .0955741      -.16         1  LOGMAR VA IN BCBE
logmar_bc~10  1054     45  .9557407      -1.6        10  LOGMAR VA IN BCBE PER 0.10 CHANGE
va2040        1054      2  .1242884         0         1  VA worse than 20/40 USING BCBE VA
uncor_re      1054      2  .7267552         0         1  UNCORRECTED REFRACTIVE ERROR
contrast      1053      9  1.881909       .75       2.1  LOGCS
cs155         1053      2  .0275404         0         1  CS WORSE THAN 155
contrast10    1053      9  18.81909       7.5        21  LOGCS PER 01.0 CHANGE
sa_min         948      9   75.7173        40       800  MINIMUM SA SEEN
sa80           948      2  .1223629         0         1  SA WORSE THAN (>) 80 SEC OF ARC
vision_visit  1067      3  1.304592         1         3  VISIT W NEW VIS PROTOCOL
typevis       1067      1         1         1         1  
visit_date     907    437   20599.9     19807     21143  visit_date
missed         907     26  2.124587         0        54  TOTAL # POINTES MISSED IN ALL FIELDS
cen            907     12  .4950386         0        31  # POINTS MISSED IN CENTRAL 20 DEGREES OF VIS FIELD
perup          907     14  1.128997         0        13  # POINTS MISSED IN UPPER PERIPHERAL VIS FIELD
perlo          907     11  .5005513         0        10  # POINTS MISSED IN LOWER PERIPHERAL VIS FIELD
vf_impaired    907      2   .061742         0         1  MISSED >1SD OF POP MEAN (>6.5 PTS MISSED)
vf_visit       907      6  2.690187         1         6  
visvfdon      1032      2  .8614341         0         1  _VISVFDON_1436
visvfrnd       140      5  707.2286       555       999  _VISVFRND_963
ina           1083      2  .9852262         0         1  
invf          1083      1         1         1         1  
bmi           1081    783   27.0131     16.87     52.45  ANTH: Body Mass Index
smokehx       1051      4  .3672693         0         3  SMOK: Smoking history
homevisit     1083      1         0         0         0  
cesd          1071     30  5.270775         0        32  CES Depression score
cescut16      1071      2   .054155         0         1  CES Symptoms of depression
cescut20      1071      2  .0233427         0         1  CES Significant symptoms of depression
sbp           1060     86  118.0755        70       192  Composed Systolic blood pressure (mmHg)
dbp           1060     49  66.99245        45        94  Composed Diastolic blood pressure (mmHg)
oact01        1068      3  .3501873         0         8  Currently works
male          1083      2  .4635272         0         1  
dod              5      2   20875.2     20847     20894  Date of Death
racecd        1080      9  1.409259         0         9  Race
educat        1069      5  3.400374         0         4  Education category (highest attained)
black         1083      2  .2640813         0         1  
indm          1083      1         1         1         1  
invs          1083      1         1         1         1  
_merge        1164      3  2.859107         1         3  
---------------------------------------------------------------------------------------------------------------------------------------------------------------

. do "C:\Users\sdu7\AppData\Local\Temp\STD3e04_000000.tmp"

. 
. foreach vis in logmar_bcbe10 cont10_inv missed sa_min {
  2. hist `vis', freq normal
  3. graph save `vis'
  4. }
(bin=30, start=-1.6, width=.38666667)
(file logmar_bcbe10.gph saved)
variable cont10_inv not found
r(111);

end of do-file

r(111);

. do "C:\Users\sdu7\AppData\Local\Temp\STD3e04_000000.tmp"

. 
. foreach vis in logmar_bcbe10 contrast10 missed sa_min {
  2. hist `vis', freq normal
  3. graph save `vis'
  4. }
(bin=30, start=-1.6, width=.38666667)
file logmar_bcbe10.gph already exists
r(602);

end of do-file

r(602);

. do "C:\Users\sdu7\AppData\Local\Temp\STD3e04_000000.tmp"

. 
. foreach vis in logmar_bcbe10 contrast10 missed sa_min {
  2. hist `vis', freq normal
  3. graph save `vis',replace
  4. }
(bin=30, start=-1.6, width=.38666667)
(file logmar_bcbe10.gph saved)
(bin=30, start=7.5, width=.45)
(note: file contrast10.gph not found)
(file contrast10.gph saved)
(bin=29, start=0, width=1.862069)
(note: file missed.gph not found)
(file missed.gph saved)
(bin=29, start=40, width=26.206897)
(note: file sa_min.gph not found)
(file sa_min.gph saved)

. graph combine "logmar_bcbe10" "contrast10" "missed" "sa_min" ,altshrink 

. graph export hist_vision.pdf,replace width(4000) 
option width() not allowed
r(198);

end of do-file

r(198);

. do "C:\Users\sdu7\AppData\Local\Temp\STD3e04_000000.tmp"

. 
. foreach vis in logmar_bcbe10 contrast10 missed sa_min {
  2. hist `vis', freq normal title("`vis'")
  3. graph save `vis',replace
  4. }
(bin=30, start=-1.6, width=.38666667)
(file logmar_bcbe10.gph saved)
(bin=30, start=7.5, width=.45)
(file contrast10.gph saved)
(bin=29, start=0, width=1.862069)
(file missed.gph saved)
(bin=29, start=40, width=26.206897)
(file sa_min.gph saved)

. graph combine "logmar_bcbe10" "contrast10" "missed" "sa_min" ,altshrink 

. graph export hist_vision.pdf,replace width(4000) 
option width() not allowed
r(198);

end of do-file

r(198);

. codebook logmar_bcbe10 contrast10 missed sa_min

---------------------------------------------------------------------------------------------------------------------------------------------------------------
logmar_bcbe10                                                                                                                 LOGMAR VA IN BCBE PER 0.10 CHANGE
---------------------------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (double)

                 range:  [-1.6,10]                    units:  1.000e-07
         unique values:  45                       missing .:  110/1,164

                  mean:   .955741
              std. dev:   1.38948

           percentiles:        10%       25%       50%       75%       90%
                                 0         0         0         2    3.0103

---------------------------------------------------------------------------------------------------------------------------------------------------------------
contrast10                                                                                                                                LOGCS PER 01.0 CHANGE
---------------------------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (double)

                 range:  [7.5,21]                     units:  .1
         unique values:  9                        missing .:  111/1,164

            tabulation:  Freq.  Value
                             1  7.5
                             2  10.5
                             3  12
                             5  13.5
                            18  15
                            85  16.5
                           273  18
                           592  19.5
                            74  21
                           111  .

---------------------------------------------------------------------------------------------------------------------------------------------------------------
missed                                                                                                                     TOTAL # POINTES MISSED IN ALL FIELDS
---------------------------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (double)

                 range:  [0,54]                       units:  1
         unique values:  26                       missing .:  257/1,164

                  mean:   2.12459
              std. dev:   3.86827

           percentiles:        10%       25%       50%       75%       90%
                                 0         0         1         3         5

---------------------------------------------------------------------------------------------------------------------------------------------------------------
sa_min                                                                                                                                          MINIMUM SA SEEN
---------------------------------------------------------------------------------------------------------------------------------------------------------------

                  type:  numeric (double)

                 range:  [40,800]                     units:  10
         unique values:  9                        missing .:  216/1,164

            tabulation:  Freq.  Value
                           621  40
                           118  50
                            65  60
                            28  80
                            31  100
                            20  140
                            25  200
                            20  400
                            20  800
                           216  .

. do "C:\Users\sdu7\AppData\Local\Temp\STD3e04_000000.tmp"

. foreach v of varlist logmar_bcbe10 contrast10 missed sa_min {
  2. local vlabel: var label `v'
  3. disp "`vlabel'"
  4. }
LOGMAR VA IN BCBE PER 0.10 CHANGE
LOGCS PER 01.0 CHANGE
TOTAL # POINTES MISSED IN ALL FIELDS
MINIMUM SA SEEN

. 
end of do-file

. do "C:\Users\sdu7\AppData\Local\Temp\STD3e04_000000.tmp"

. 
. foreach vis in logmar_bcbe10 contrast10 missed sa_min {
  2. hist `vis', freq normal title("`vlabel'")
  3. graph save `vis',replace
  4. }
(bin=30, start=-1.6, width=.38666667)
(file logmar_bcbe10.gph saved)
(bin=30, start=7.5, width=.45)
(file contrast10.gph saved)
(bin=29, start=0, width=1.862069)
(file missed.gph saved)
(bin=29, start=40, width=26.206897)
(file sa_min.gph saved)

. graph combine "logmar_bcbe10" "contrast10" "missed" "sa_min" ,altshrink 

. graph export hist_vision.pdf,replace width(4000) 
option width() not allowed
r(198);

end of do-file

r(198);

. do "C:\Users\sdu7\AppData\Local\Temp\STD3e04_000000.tmp"

. 
. foreach vis in logmar_bcbe10 contrast10 missed sa_min {
  2. local vlabel: var label `v'
  3. disp "`vlabel'"
  4. hist `vis', freq normal title("`vlabel'")
  5. graph save `vis',replace
  6. }
nothing found where name expected
r(198);

end of do-file

r(198);

. do "C:\Users\sdu7\AppData\Local\Temp\STD3e04_000000.tmp"

. 
. foreach v in logmar_bcbe10 contrast10 missed sa_min {
  2. local vlabel: var label `v'
  3. disp "`vlabel'"
  4. hist `vis', freq normal title("`vlabel'")
  5. graph save `vis',replace
  6. }
LOGMAR VA IN BCBE PER 0.10 CHANGE
varlist required
r(100);

end of do-file

r(100);

. do "C:\Users\sdu7\AppData\Local\Temp\STD3e04_000000.tmp"

. foreach v in logmar_bcbe10 contrast10 missed sa_min {
  2. local vlabel: var label `v'
  3. disp "`vlabel'"
  4. hist `v', freq normal title("`vlabel'")
  5. graph save `v',replace
  6. }
LOGMAR VA IN BCBE PER 0.10 CHANGE
(bin=30, start=-1.6, width=.38666667)
(file logmar_bcbe10.gph saved)
LOGCS PER 01.0 CHANGE
(bin=30, start=7.5, width=.45)
(file contrast10.gph saved)
TOTAL # POINTES MISSED IN ALL FIELDS
(bin=29, start=0, width=1.862069)
(file missed.gph saved)
MINIMUM SA SEEN
(bin=29, start=40, width=26.206897)
(file sa_min.gph saved)

. graph combine "logmar_bcbe10" "contrast10" "missed" "sa_min" ,altshrink 

. graph export hist_vision.png,replace width(4000) 
(note: file hist_vision.png not found)
(file hist_vision.png written in PNG format)

. 
. 
end of do-file

. do "C:\Users\sdu7\AppData\Local\Temp\STD3e04_000000.tmp"

. * DIF _EDA_ vision and cognition 
. * Simo
. * Aug 23rd 
. * __________________________________
. 
. // house keeping 
. clear all

. capture log close
